export type Commune = {
  name: string;
  slug: string;
};

export type Province = {
  name: string;
  slug: string;
  communes: Commune[];
};

export type MoroccoRegion = {
  name: string;
  slug: string;
  provinces: Province[];
};

export const moroccoRegions: MoroccoRegion[] = [
  {
    "name": "جهة طنجة.تطوان. الحسيمة",
    "slug": "جهة-طنجة-تطوان-الحسيمة",
    "provinces": [
      {
        "name": "عمالة طنجة أصيلة",
        "slug": "عمالة-طنجة-ا-صيلة",
        "communes": [
          {
            "name": "طنجة",
            "slug": "طنجة"
          },
          {
            "name": "أصيلة",
            "slug": "ا-صيلة"
          },
          {
            "name": "اكزناية",
            "slug": "اكزناية"
          },
          {
            "name": "حجر النحل",
            "slug": "حجر-النحل"
          },
          {
            "name": "دار الشاوي",
            "slug": "دار-الشاوي"
          },
          {
            "name": "المنزلة",
            "slug": "المنزلة"
          },
          {
            "name": "العوامة",
            "slug": "العوامة"
          },
          {
            "name": "سبت الزينات",
            "slug": "سبت-الزينات"
          },
          {
            "name": "اقواس برييش",
            "slug": "اقواس-برييش"
          },
          {
            "name": "حد الغربية",
            "slug": "حد-الغربية"
          },
          {
            "name": "الساحل الشمالي",
            "slug": "الساحل-الشمالي"
          }
        ]
      },
      {
        "name": "إقليم الفحص انجرة",
        "slug": "ا-قليم-الفحص-انجرة",
        "communes": [
          {
            "name": "ملوسة",
            "slug": "ملوسة"
          },
          {
            "name": "البحراويين",
            "slug": "البحراويين"
          },
          {
            "name": "القصر الصغير",
            "slug": "القصر-الصغير"
          },
          {
            "name": "جوامعة",
            "slug": "جوامعة"
          },
          {
            "name": "أنجرة",
            "slug": "ا-نجرة"
          },
          {
            "name": "تغرامت",
            "slug": "تغرامت"
          },
          {
            "name": "القصر المجاز",
            "slug": "القصر-المجاز"
          }
        ]
      },
      {
        "name": "عمالة المضيق الفنيدق",
        "slug": "عمالة-المضيق-الفنيدق",
        "communes": [
          {
            "name": "المضيق",
            "slug": "المضيق"
          },
          {
            "name": "الفنيدق",
            "slug": "الفنيدق"
          },
          {
            "name": "مرتيل",
            "slug": "مرتيل"
          },
          {
            "name": "عليين",
            "slug": "عليين"
          },
          {
            "name": "بليونش",
            "slug": "بليونش"
          }
        ]
      },
      {
        "name": "إقليم تطوان",
        "slug": "ا-قليم-تطوان",
        "communes": [
          {
            "name": "تطوان",
            "slug": "تطوان"
          },
          {
            "name": "واد لو",
            "slug": "واد-لو"
          },
          {
            "name": "عين لحصن",
            "slug": "عين-لحصن"
          },
          {
            "name": "سوق القديم",
            "slug": "سوق-القديم"
          },
          {
            "name": "جبل لحبيب",
            "slug": "جبل-لحبيب"
          },
          {
            "name": "بني حرشن",
            "slug": "بني-حرشن"
          },
          {
            "name": "الخروب",
            "slug": "الخروب"
          },
          {
            "name": "الملاليين",
            "slug": "الملاليين"
          },
          {
            "name": "صدينة",
            "slug": "صدينة"
          },
          {
            "name": "السحتريين",
            "slug": "السحتريين"
          },
          {
            "name": "بني يدر",
            "slug": "بني-يدر"
          },
          {
            "name": "بغاغزة",
            "slug": "بغاغزة"
          },
          {
            "name": "بني ليث",
            "slug": "بني-ليث"
          },
          {
            "name": "الحمراء",
            "slug": "الحمراء"
          },
          {
            "name": "الواد",
            "slug": "الواد"
          },
          {
            "name": "أولاد علي منصور",
            "slug": "ا-ولاد-علي-منصور"
          },
          {
            "name": "دار بني قريش",
            "slug": "دار-بني-قريش"
          },
          {
            "name": "الزينات",
            "slug": "الزينات"
          },
          {
            "name": "أزلا",
            "slug": "ا-زلا"
          },
          {
            "name": "الزيتون",
            "slug": "الزيتون"
          },
          {
            "name": "بني سعيد",
            "slug": "بني-سعيد"
          },
          {
            "name": "زاوية سيدي قاسم",
            "slug": "زاوية-سيدي-قاسم"
          }
        ]
      },
      {
        "name": "إقليم العرائش",
        "slug": "ا-قليم-العراي-ش",
        "communes": [
          {
            "name": "القصر الكبير",
            "slug": "القصر-الكبير"
          },
          {
            "name": "العرائش",
            "slug": "العراي-ش"
          },
          {
            "name": "العوامرة",
            "slug": "العوامرة"
          },
          {
            "name": "زوادة",
            "slug": "زوادة"
          },
          {
            "name": "قصر بجير",
            "slug": "قصر-بجير"
          },
          {
            "name": "بوجديان",
            "slug": "بوجديان"
          },
          {
            "name": "تطفت",
            "slug": "تطفت"
          },
          {
            "name": "سوق القلة",
            "slug": "سوق-القلة"
          },
          {
            "name": "بني عروس",
            "slug": "بني-عروس"
          },
          {
            "name": "تازروت",
            "slug": "تازروت"
          },
          {
            "name": "عياشة",
            "slug": "عياشة"
          },
          {
            "name": "بني كرفط",
            "slug": "بني-كرفط"
          },
          {
            "name": "زعرورة",
            "slug": "زعرورة"
          },
          {
            "name": "الساحل",
            "slug": "الساحل"
          },
          {
            "name": "ريصانة الشمالية",
            "slug": "ريصانة-الشمالية"
          },
          {
            "name": "ريصانة الجنوبية",
            "slug": "ريصانة-الجنوبية"
          },
          {
            "name": "أولاد اوشيح",
            "slug": "ا-ولاد-اوشيح"
          },
          {
            "name": "السواكن",
            "slug": "السواكن"
          },
          {
            "name": "سوق الطلبة",
            "slug": "سوق-الطلبة"
          }
        ]
      },
      {
        "name": "إقليم الحسيمة",
        "slug": "ا-قليم-الحسيمة",
        "communes": [
          {
            "name": "الحسيمة",
            "slug": "الحسيمة"
          },
          {
            "name": "بني بوعياش",
            "slug": "بني-بوعياش"
          },
          {
            "name": "امزورن",
            "slug": "امزورن"
          },
          {
            "name": "تارجيست",
            "slug": "تارجيست"
          },
          {
            "name": "اجدير",
            "slug": "اجدير"
          },
          {
            "name": "بني بوفراح",
            "slug": "بني-بوفراح"
          },
          {
            "name": "سنادة",
            "slug": "سنادة"
          },
          {
            "name": "بني جميل مكصولين",
            "slug": "بني-جميل-مكصولين"
          },
          {
            "name": "بني اكميل",
            "slug": "بني-اكميل"
          },
          {
            "name": "شقران",
            "slug": "شقران"
          },
          {
            "name": "أربعاء تاوريرت",
            "slug": "ا-ربعاء-تاوريرت"
          },
          {
            "name": "تيفروين",
            "slug": "تيفروين"
          },
          {
            "name": "النكور",
            "slug": "النكور"
          },
          {
            "name": "زاوية سيدي عبد القادر",
            "slug": "زاوية-سيدي-عبد-القادر"
          },
          {
            "name": "بني حذيفة",
            "slug": "بني-حذيفة"
          },
          {
            "name": "بني عبد الله",
            "slug": "بني-عبد-الله"
          },
          {
            "name": "ايت يوسف وعلي",
            "slug": "ايت-يوسف-وعلي"
          },
          {
            "name": "لوطا",
            "slug": "لوطا"
          },
          {
            "name": "امرابطن",
            "slug": "امرابطن"
          },
          {
            "name": "ازمورن",
            "slug": "ازمورن"
          },
          {
            "name": "ايت قمرة",
            "slug": "ايت-قمرة"
          },
          {
            "name": "ارواضي",
            "slug": "ارواضي"
          },
          {
            "name": "سيدي بوزينب",
            "slug": "سيدي-بوزينب"
          },
          {
            "name": "بني عمارت",
            "slug": "بني-عمارت"
          },
          {
            "name": "سيدي بوتميم",
            "slug": "سيدي-بوتميم"
          },
          {
            "name": "زرقت",
            "slug": "زرقت"
          },
          {
            "name": "بني ابشير",
            "slug": "بني-ابشير"
          },
          {
            "name": "بني بونصار",
            "slug": "بني-بونصار"
          },
          {
            "name": "بني احمد اموكزان",
            "slug": "بني-احمد-اموكزان"
          },
          {
            "name": "تامساوت",
            "slug": "تامساوت"
          },
          {
            "name": "كتامة",
            "slug": "كتامة"
          },
          {
            "name": "مولاي احمد الشريف",
            "slug": "مولاي-احمد-الشريف"
          },
          {
            "name": "اساكن",
            "slug": "اساكن"
          },
          {
            "name": "بني بوشيبت",
            "slug": "بني-بوشيبت"
          },
          {
            "name": "تاغزوت",
            "slug": "تاغزوت"
          },
          {
            "name": "عبد الغاية السواحل",
            "slug": "عبد-الغاية-السواحل"
          }
        ]
      },
      {
        "name": "إقليم شفشاون",
        "slug": "ا-قليم-شفشاون",
        "communes": [
          {
            "name": "شفشاون",
            "slug": "شفشاون"
          },
          {
            "name": "باب برد",
            "slug": "باب-برد"
          },
          {
            "name": "اونان",
            "slug": "اونان"
          },
          {
            "name": "تمروت",
            "slug": "تمروت"
          },
          {
            "name": "امتار",
            "slug": "امتار"
          },
          {
            "name": "متيوة",
            "slug": "متيوة"
          },
          {
            "name": "ووزكان",
            "slug": "ووزكان"
          },
          {
            "name": "بني رزين",
            "slug": "بني-رزين"
          },
          {
            "name": "بني سميح",
            "slug": "بني-سميح"
          },
          {
            "name": "بني احمد الشرقية",
            "slug": "بني-احمد-الشرقية"
          },
          {
            "name": "بني احمد الغربية",
            "slug": "بني-احمد-الغربية"
          },
          {
            "name": "واد ملحة",
            "slug": "واد-ملحة"
          },
          {
            "name": "المنصورة",
            "slug": "المنصورة"
          },
          {
            "name": "باب تازة",
            "slug": "باب-تازة"
          },
          {
            "name": "بني صالح",
            "slug": "بني-صالح"
          },
          {
            "name": "بني دركول",
            "slug": "بني-دركول"
          },
          {
            "name": "بني فغلوم",
            "slug": "بني-فغلوم"
          },
          {
            "name": "فيفي",
            "slug": "فيفي"
          },
          {
            "name": "الدردارة",
            "slug": "الدردارة"
          },
          {
            "name": "تنقوب",
            "slug": "تنقوب"
          },
          {
            "name": "لغدير",
            "slug": "لغدير"
          },
          {
            "name": "بني سلمان",
            "slug": "بني-سلمان"
          },
          {
            "name": "بني منصور",
            "slug": "بني-منصور"
          },
          {
            "name": "بني بوزرة",
            "slug": "بني-بوزرة"
          },
          {
            "name": "اسطيحة",
            "slug": "اسطيحة"
          },
          {
            "name": "تزكان",
            "slug": "تزكان"
          },
          {
            "name": "تاسيفت",
            "slug": "تاسيفت"
          },
          {
            "name": "تلمبوط",
            "slug": "تلمبوط"
          }
        ]
      },
      {
        "name": "إقليم وزان",
        "slug": "ا-قليم-وزان",
        "communes": [
          {
            "name": "وزان",
            "slug": "وزان"
          },
          {
            "name": "امزفرون",
            "slug": "امزفرون"
          },
          {
            "name": "مصمودة",
            "slug": "مصمودة"
          },
          {
            "name": "سيدي رضوان",
            "slug": "سيدي-رضوان"
          },
          {
            "name": "بني كلة",
            "slug": "بني-كلة"
          },
          {
            "name": "تروال",
            "slug": "تروال"
          },
          {
            "name": "ازغيرة",
            "slug": "ازغيرة"
          },
          {
            "name": "ونانة",
            "slug": "ونانة"
          },
          {
            "name": "لمجاعرة",
            "slug": "لمجاعرة"
          },
          {
            "name": "سيدي أحمد الشريف",
            "slug": "سيدي-ا-حمد-الشريف"
          },
          {
            "name": "سيدي بوصبر",
            "slug": "سيدي-بوصبر"
          },
          {
            "name": "ابريكشة",
            "slug": "ابريكشة"
          },
          {
            "name": "اسجن",
            "slug": "اسجن"
          },
          {
            "name": "مقريصات",
            "slug": "مقريصات"
          },
          {
            "name": "عين بيضاء",
            "slug": "عين-بيضاء"
          },
          {
            "name": "قلعة بوقرة",
            "slug": "قلعة-بوقرة"
          },
          {
            "name": "زومي",
            "slug": "زومي"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة الشرق",
    "slug": "جهة-الشرق",
    "provinces": [
      {
        "name": "عمالة وجدة أنجاد",
        "slug": "عمالة-وجدة-ا-نجاد",
        "communes": [
          {
            "name": "وجدة",
            "slug": "وجدة"
          },
          {
            "name": "بني درار",
            "slug": "بني-درار"
          },
          {
            "name": "النعيمة",
            "slug": "النعيمة"
          },
          {
            "name": "عين الصفا",
            "slug": "عين-الصفا"
          },
          {
            "name": "لبصارة",
            "slug": "لبصارة"
          },
          {
            "name": "بني خالد",
            "slug": "بني-خالد"
          },
          {
            "name": "اهل انكاد",
            "slug": "اهل-انكاد"
          },
          {
            "name": "مستفركي",
            "slug": "مستفركي"
          },
          {
            "name": "سيدي بولنوار",
            "slug": "سيدي-بولنوار"
          },
          {
            "name": "سيدي موسى - لمهاية",
            "slug": "سيدي-موسى-لمهاية"
          },
          {
            "name": "اسلي",
            "slug": "اسلي"
          }
        ]
      },
      {
        "name": "إقليم الناظور",
        "slug": "ا-قليم-الناظور",
        "communes": [
          {
            "name": "الناضور",
            "slug": "الناضور"
          },
          {
            "name": "ازغنغان",
            "slug": "ازغنغان"
          },
          {
            "name": "بني انصار",
            "slug": "بني-انصار"
          },
          {
            "name": "العروي",
            "slug": "العروي"
          },
          {
            "name": "زايو",
            "slug": "زايو"
          },
          {
            "name": "سلوان",
            "slug": "سلوان"
          },
          {
            "name": "راس الماء",
            "slug": "راس-الماء"
          },
          {
            "name": "بني بويفرور",
            "slug": "بني-بويفرور"
          },
          {
            "name": "إيحدادن",
            "slug": "ا-يحدادن"
          },
          {
            "name": "إيكسان",
            "slug": "ا-يكسان"
          },
          {
            "name": "بوعراك",
            "slug": "بوعراك"
          },
          {
            "name": "إيعزانن",
            "slug": "ا-يعزانن"
          },
          {
            "name": "بني شيكر",
            "slug": "بني-شيكر"
          },
          {
            "name": "بني سيدال الجبل",
            "slug": "بني-سيدال-الجبل"
          },
          {
            "name": "بني سيدال لوطا",
            "slug": "بني-سيدال-لوطا"
          },
          {
            "name": "حاسي بركان",
            "slug": "حاسي-بركان"
          },
          {
            "name": "افسو",
            "slug": "افسو"
          },
          {
            "name": "تزطوطين",
            "slug": "تزطوطين"
          },
          {
            "name": "بني وكيل أولاد محاند",
            "slug": "بني-وكيل-ا-ولاد-محاند"
          },
          {
            "name": "أركمان",
            "slug": "ا-ركمان"
          },
          {
            "name": "البركانيين",
            "slug": "البركانيين"
          },
          {
            "name": "أولاد ستوت",
            "slug": "ا-ولاد-ستوت"
          },
          {
            "name": "أولاد داوود ازخانين",
            "slug": "ا-ولاد-داوود-ازخانين"
          }
        ]
      },
      {
        "name": "اقليم الدريوش",
        "slug": "اقليم-الدريوش",
        "communes": [
          {
            "name": "الدريوش",
            "slug": "الدريوش"
          },
          {
            "name": "بن الطيب",
            "slug": "بن-الطيب"
          },
          {
            "name": "ميضار",
            "slug": "ميضار"
          },
          {
            "name": "تليليت",
            "slug": "تليليت"
          },
          {
            "name": "وردانة",
            "slug": "وردانة"
          },
          {
            "name": "امهاجر",
            "slug": "امهاجر"
          },
          {
            "name": "افرني",
            "slug": "افرني"
          },
          {
            "name": "تفرسيت",
            "slug": "تفرسيت"
          },
          {
            "name": "ازلاف",
            "slug": "ازلاف"
          },
          {
            "name": "اتسافت",
            "slug": "اتسافت"
          },
          {
            "name": "اجرمواس",
            "slug": "اجرمواس"
          },
          {
            "name": "أولاد أمغار",
            "slug": "ا-ولاد-ا-مغار"
          },
          {
            "name": "بودينار",
            "slug": "بودينار"
          },
          {
            "name": "بني مرغنين",
            "slug": "بني-مرغنين"
          },
          {
            "name": "تمسمان",
            "slug": "تمسمان"
          },
          {
            "name": "اتروكوت",
            "slug": "اتروكوت"
          },
          {
            "name": "امطالسة",
            "slug": "امطالسة"
          },
          {
            "name": "عين الزهرة",
            "slug": "عين-الزهرة"
          },
          {
            "name": "أولاد بوبكر",
            "slug": "ا-ولاد-بوبكر"
          },
          {
            "name": "دار الكبداني",
            "slug": "دار-الكبداني"
          },
          {
            "name": "تزاغين",
            "slug": "تزاغين"
          },
          {
            "name": "امجاو",
            "slug": "امجاو"
          },
          {
            "name": "أيت مايت",
            "slug": "ا-يت-مايت"
          }
        ]
      },
      {
        "name": "إقليم جرادة",
        "slug": "ا-قليم-جرادة",
        "communes": [
          {
            "name": "جرادة",
            "slug": "جرادة"
          },
          {
            "name": "عين بني مطهر",
            "slug": "عين-بني-مطهر"
          },
          {
            "name": "تويسيت",
            "slug": "تويسيت"
          },
          {
            "name": "لعوينات",
            "slug": "لعوينات"
          },
          {
            "name": "كنفودة",
            "slug": "كنفودة"
          },
          {
            "name": "كفايت",
            "slug": "كفايت"
          },
          {
            "name": "لبخاتة",
            "slug": "لبخاتة"
          },
          {
            "name": "راس عصفور",
            "slug": "راس-عصفور"
          },
          {
            "name": "سيدي بوبكر",
            "slug": "سيدي-بوبكر"
          },
          {
            "name": "تيولي",
            "slug": "تيولي"
          },
          {
            "name": "بني مطهر",
            "slug": "بني-مطهر"
          },
          {
            "name": "اولاد سيدي عبد الحاكم",
            "slug": "اولاد-سيدي-عبد-الحاكم"
          },
          {
            "name": "مريجة",
            "slug": "مريجة"
          },
          {
            "name": "اولاد غزيل",
            "slug": "اولاد-غزيل"
          }
        ]
      },
      {
        "name": "إقليم بركان",
        "slug": "ا-قليم-بركان",
        "communes": [
          {
            "name": "بركان",
            "slug": "بركان"
          },
          {
            "name": "أحفير",
            "slug": "ا-حفير"
          },
          {
            "name": "السعيدية",
            "slug": "السعيدية"
          },
          {
            "name": "أكليم",
            "slug": "ا-كليم"
          },
          {
            "name": "عين الركادة",
            "slug": "عين-الركادة"
          },
          {
            "name": "سيدي سليمان- الشراعة",
            "slug": "سيدي-سليمان-الشراعة"
          },
          {
            "name": "لعثامنة",
            "slug": "لعثامنة"
          },
          {
            "name": "مداغ",
            "slug": "مداغ"
          },
          {
            "name": "فزوان",
            "slug": "فزوان"
          },
          {
            "name": "أغبال",
            "slug": "ا-غبال"
          },
          {
            "name": "بوغريبة",
            "slug": "بوغريبة"
          },
          {
            "name": "الشويحية",
            "slug": "الشويحية"
          },
          {
            "name": "ريسلان",
            "slug": "ريسلان"
          },
          {
            "name": "سيدي بوهرية",
            "slug": "سيدي-بوهرية"
          },
          {
            "name": "تافوغالت",
            "slug": "تافوغالت"
          },
          {
            "name": "زكزل",
            "slug": "زكزل"
          }
        ]
      },
      {
        "name": "إقليم تاوريرت",
        "slug": "ا-قليم-تاوريرت",
        "communes": [
          {
            "name": "تاوريرت",
            "slug": "تاوريرت"
          },
          {
            "name": "العيون- سيدي ملوك",
            "slug": "العيون-سيدي-ملوك"
          },
          {
            "name": "دبدو",
            "slug": "دبدو"
          },
          {
            "name": "اكطيطير",
            "slug": "اكطيطير"
          },
          {
            "name": "أهل واد زا",
            "slug": "ا-هل-واد-زا"
          },
          {
            "name": "ملك الويدان",
            "slug": "ملك-الويدان"
          },
          {
            "name": "عين الحجر",
            "slug": "عين-الحجر"
          },
          {
            "name": "مشرع حمادي",
            "slug": "مشرع-حمادي"
          },
          {
            "name": "مستكمر",
            "slug": "مستكمر"
          },
          {
            "name": "تنشرفي",
            "slug": "تنشرفي"
          },
          {
            "name": "سيدي علي بلقاسم",
            "slug": "سيدي-علي-بلقاسم"
          },
          {
            "name": "سيدي لحسن",
            "slug": "سيدي-لحسن"
          },
          {
            "name": "العطف",
            "slug": "العطف"
          },
          {
            "name": "اولاد امحمد",
            "slug": "اولاد-امحمد"
          }
        ]
      },
      {
        "name": "إقليم جرسيف",
        "slug": "ا-قليم-جرسيف",
        "communes": [
          {
            "name": "جرسيف",
            "slug": "جرسيف"
          },
          {
            "name": "الصباب",
            "slug": "الصباب"
          },
          {
            "name": "بركين",
            "slug": "بركين"
          },
          {
            "name": "هوارة أولاد رحو",
            "slug": "هوارة-ا-ولاد-رحو"
          },
          {
            "name": "لمريجة",
            "slug": "لمريجة"
          },
          {
            "name": "صاكة",
            "slug": "صاكة"
          },
          {
            "name": "راس القصر",
            "slug": "راس-القصر"
          },
          {
            "name": "تادرت",
            "slug": "تادرت"
          },
          {
            "name": "أولاد بوريمة",
            "slug": "ا-ولاد-بوريمة"
          },
          {
            "name": "مزكيتام",
            "slug": "مزكيتام"
          }
        ]
      },
      {
        "name": "إقليم فجيج",
        "slug": "ا-قليم-فجيج",
        "communes": [
          {
            "name": "فجيج",
            "slug": "فجيج"
          },
          {
            "name": "بوعرفة",
            "slug": "بوعرفة"
          },
          {
            "name": "بني تدجيت",
            "slug": "بني-تدجيت"
          },
          {
            "name": "بوعنان",
            "slug": "بوعنان"
          },
          {
            "name": "عين الشعير",
            "slug": "عين-الشعير"
          },
          {
            "name": "عين الشواطر",
            "slug": "عين-الشواطر"
          },
          {
            "name": "بومريم",
            "slug": "بومريم"
          },
          {
            "name": "تالسينت",
            "slug": "تالسينت"
          },
          {
            "name": "بوشاون",
            "slug": "بوشاون"
          },
          {
            "name": "بني كيل",
            "slug": "بني-كيل"
          },
          {
            "name": "عبو لكحل",
            "slug": "عبو-لكحل"
          },
          {
            "name": "معتركة",
            "slug": "معتركة"
          },
          {
            "name": "تندرارة",
            "slug": "تندرارة"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة فاس – مكناس",
    "slug": "جهة-فاس-مكناس",
    "provinces": [
      {
        "name": "عمالة فاس",
        "slug": "عمالة-فاس",
        "communes": [
          {
            "name": "فاس",
            "slug": "فاس"
          },
          {
            "name": "المشور فاس الجديد",
            "slug": "المشور-فاس-الجديد"
          },
          {
            "name": "أولاد الطيب",
            "slug": "ا-ولاد-الطيب"
          },
          {
            "name": "سيدي حرازم",
            "slug": "سيدي-حرازم"
          },
          {
            "name": "عين البيضاء",
            "slug": "عين-البيضاء"
          }
        ]
      },
      {
        "name": "عمالة مكناس",
        "slug": "عمالة-مكناس",
        "communes": [
          {
            "name": "مكناس",
            "slug": "مكناس"
          },
          {
            "name": "المشور استينية",
            "slug": "المشور-استينية"
          },
          {
            "name": "مولاي إدريس زرهون",
            "slug": "مولاي-ا-دريس-زرهون"
          },
          {
            "name": "ويسلان",
            "slug": "ويسلان"
          },
          {
            "name": "بوفكران",
            "slug": "بوفكران"
          },
          {
            "name": "تولال",
            "slug": "تولال"
          },
          {
            "name": "وليلي",
            "slug": "وليلي"
          },
          {
            "name": "المغاصيين",
            "slug": "المغاصيين"
          },
          {
            "name": "سيدي عبد الله الخياط",
            "slug": "سيدي-عبد-الله-الخياط"
          },
          {
            "name": "شرقاوة",
            "slug": "شرقاوة"
          },
          {
            "name": "نزالة بني عمار",
            "slug": "نزالة-بني-عمار"
          },
          {
            "name": "الدخيسة",
            "slug": "الدخيسة"
          },
          {
            "name": "واد الجديدة",
            "slug": "واد-الجديدة"
          },
          {
            "name": "ال مهاية",
            "slug": "ال-مهاية"
          },
          {
            "name": "مجاط",
            "slug": "مجاط"
          },
          {
            "name": "سيدي سليمان مول الكيفان",
            "slug": "سيدي-سليمان-مول-الكيفان"
          },
          {
            "name": "عين عرمة",
            "slug": "عين-عرمة"
          },
          {
            "name": "دار أم السلطان",
            "slug": "دار-ا-م-السلطان"
          },
          {
            "name": "آيت ولال",
            "slug": "ا-يت-ولال"
          },
          {
            "name": "عين كرمة- واد الرمان",
            "slug": "عين-كرمة-واد-الرمان"
          },
          {
            "name": "عين جمعة",
            "slug": "عين-جمعة"
          }
        ]
      },
      {
        "name": "إقليم الحاجب",
        "slug": "ا-قليم-الحاجب",
        "communes": [
          {
            "name": "الحاجب",
            "slug": "الحاجب"
          },
          {
            "name": "سبع عيون",
            "slug": "سبع-عيون"
          },
          {
            "name": "عين تاوجدات",
            "slug": "عين-تاوجدات"
          },
          {
            "name": "اكوراي",
            "slug": "اكوراي"
          },
          {
            "name": "آيت نعمان",
            "slug": "ا-يت-نعمان"
          },
          {
            "name": "إقدار",
            "slug": "ا-قدار"
          },
          {
            "name": "آيت بورزوين",
            "slug": "ا-يت-بورزوين"
          },
          {
            "name": "آيت حرز الله",
            "slug": "ا-يت-حرز-الله"
          },
          {
            "name": "آيت بوبيدمان",
            "slug": "ا-يت-بوبيدمان"
          },
          {
            "name": "بطيط",
            "slug": "بطيط"
          },
          {
            "name": "لقصير",
            "slug": "لقصير"
          },
          {
            "name": "تامشاشاط",
            "slug": "تامشاشاط"
          },
          {
            "name": "آيت يعزم",
            "slug": "ا-يت-يعزم"
          },
          {
            "name": "آيت ويخلفن",
            "slug": "ا-يت-ويخلفن"
          },
          {
            "name": "جحجوح",
            "slug": "جحجوح"
          },
          {
            "name": "رأس ايجيري",
            "slug": "را-س-ايجيري"
          }
        ]
      },
      {
        "name": "إقليم إفران",
        "slug": "ا-قليم-ا-فران",
        "communes": [
          {
            "name": "أزرو",
            "slug": "ا-زرو"
          },
          {
            "name": "إفران",
            "slug": "ا-فران"
          },
          {
            "name": "تيزكيت",
            "slug": "تيزكيت"
          },
          {
            "name": "ضاية عوا",
            "slug": "ضاية-عوا"
          },
          {
            "name": "بن صميم",
            "slug": "بن-صميم"
          },
          {
            "name": "تيكريكرة",
            "slug": "تيكريكرة"
          },
          {
            "name": "تيمحضيت",
            "slug": "تيمحضيت"
          },
          {
            "name": "عين اللوح",
            "slug": "عين-اللوح"
          },
          {
            "name": "سيدي المخفي",
            "slug": "سيدي-المخفي"
          },
          {
            "name": "واد إفران",
            "slug": "واد-ا-فران"
          }
        ]
      },
      {
        "name": "إقليم مولاي يعقوب",
        "slug": "ا-قليم-مولاي-يعقوب",
        "communes": [
          {
            "name": "مولاي يعقوب",
            "slug": "مولاي-يعقوب"
          },
          {
            "name": "سبع رواضي",
            "slug": "سبع-رواضي"
          },
          {
            "name": "ميكس",
            "slug": "ميكس"
          },
          {
            "name": "سبت الأوداية",
            "slug": "سبت-الا-وداية"
          },
          {
            "name": "عين الشقف",
            "slug": "عين-الشقف"
          },
          {
            "name": "لعجاجرة",
            "slug": "لعجاجرة"
          },
          {
            "name": "سيدي داود",
            "slug": "سيدي-داود"
          },
          {
            "name": "أولاد ميمون",
            "slug": "ا-ولاد-ميمون"
          },
          {
            "name": "ا لوادين",
            "slug": "ا-لوادين"
          },
          {
            "name": "عين قنصرة",
            "slug": "عين-قنصرة"
          },
          {
            "name": "عين بو علي",
            "slug": "عين-بو-علي"
          }
        ]
      },
      {
        "name": "إقليم صفرو",
        "slug": "ا-قليم-صفرو",
        "communes": [
          {
            "name": "صفرو",
            "slug": "صفرو"
          },
          {
            "name": "إيموزار كندر",
            "slug": "ا-يموزار-كندر"
          },
          {
            "name": "البهاليل",
            "slug": "البهاليل"
          },
          {
            "name": "المنزل",
            "slug": "المنزل"
          },
          {
            "name": "رباط الخير",
            "slug": "رباط-الخير"
          },
          {
            "name": "كندر سيدي اخيار",
            "slug": "كندر-سيدي-اخيار"
          },
          {
            "name": "العنوصر",
            "slug": "العنوصر"
          },
          {
            "name": "تازوطة",
            "slug": "تازوطة"
          },
          {
            "name": "عزابة",
            "slug": "عزابة"
          },
          {
            "name": "أهل سيدي لحسن",
            "slug": "ا-هل-سيدي-لحسن"
          },
          {
            "name": "سيدي يوسف بن أحمد",
            "slug": "سيدي-يوسف-بن-ا-حمد"
          },
          {
            "name": "أغبالو أقُورار",
            "slug": "ا-غبالو-ا-ق-ورار"
          },
          {
            "name": "عين تمكناي",
            "slug": "عين-تمكناي"
          },
          {
            "name": "امطرناغة",
            "slug": "امطرناغة"
          },
          {
            "name": "أولاد امكودو",
            "slug": "ا-ولاد-امكودو"
          },
          {
            "name": "تفاجيغت",
            "slug": "تفاجيغت"
          },
          {
            "name": "أدرج",
            "slug": "ا-درج"
          },
          {
            "name": "دار الحمراء",
            "slug": "دار-الحمراء"
          },
          {
            "name": "إغزران",
            "slug": "ا-غزران"
          },
          {
            "name": "راس تابودا",
            "slug": "راس-تابودا"
          },
          {
            "name": "بئر طم طم",
            "slug": "بي-ر-طم-طم"
          },
          {
            "name": "عين الشكاك",
            "slug": "عين-الشكاك"
          },
          {
            "name": "آيت السبع لجروف",
            "slug": "ا-يت-السبع-لجروف"
          }
        ]
      },
      {
        "name": "إقليم بولمان",
        "slug": "ا-قليم-بولمان",
        "communes": [
          {
            "name": "بولمان",
            "slug": "بولمان"
          },
          {
            "name": "ميسور",
            "slug": "ميسور"
          },
          {
            "name": "أوطاط الحاج",
            "slug": "ا-وطاط-الحاج"
          },
          {
            "name": "إيموزار مرموشة",
            "slug": "ا-يموزار-مرموشة"
          },
          {
            "name": "كيكو",
            "slug": "كيكو"
          },
          {
            "name": "سرغينة",
            "slug": "سرغينة"
          },
          {
            "name": "أنجيل",
            "slug": "ا-نجيل"
          },
          {
            "name": "آيت المان",
            "slug": "ا-يت-المان"
          },
          {
            "name": "آيت بازا",
            "slug": "ا-يت-بازا"
          },
          {
            "name": "ألميس مرموشة",
            "slug": "ا-لميس-مرموشة"
          },
          {
            "name": "تالزمت",
            "slug": "تالزمت"
          },
          {
            "name": "المرس",
            "slug": "المرس"
          },
          {
            "name": "سكورة - مداز",
            "slug": "سكورة-مداز"
          },
          {
            "name": "القصابي- ملوية",
            "slug": "القصابي-ملوية"
          },
          {
            "name": "ويزغت",
            "slug": "ويزغت"
          },
          {
            "name": "سيدي بوطيب",
            "slug": "سيدي-بوطيب"
          },
          {
            "name": "أولاد علي يوسف",
            "slug": "ا-ولاد-علي-يوسف"
          },
          {
            "name": "العرجان",
            "slug": "العرجان"
          },
          {
            "name": "تيساف",
            "slug": "تيساف"
          },
          {
            "name": "الرميلة",
            "slug": "الرميلة"
          },
          {
            "name": "ا فريطيسة",
            "slug": "ا-فريطيسة"
          }
        ]
      },
      {
        "name": "إقليم تاونات",
        "slug": "ا-قليم-تاونات",
        "communes": [
          {
            "name": "تاونات",
            "slug": "تاونات"
          },
          {
            "name": "قرية با محمد",
            "slug": "قرية-با-محمد"
          },
          {
            "name": "غفساي",
            "slug": "غفساي"
          },
          {
            "name": "طهر السوق",
            "slug": "طهر-السوق"
          },
          {
            "name": "تيسة",
            "slug": "تيسة"
          },
          {
            "name": "بوشابل",
            "slug": "بوشابل"
          },
          {
            "name": "جبابرة",
            "slug": "جبابرة"
          },
          {
            "name": "سيدي العابد",
            "slug": "سيدي-العابد"
          },
          {
            "name": "الولجة",
            "slug": "الولجة"
          },
          {
            "name": "مولاي عبد الكريم",
            "slug": "مولاي-عبد-الكريم"
          },
          {
            "name": "بني سنوس",
            "slug": "بني-سنوس"
          },
          {
            "name": "مولاي بوشتى",
            "slug": "مولاي-بوشتى"
          },
          {
            "name": "المكانسة",
            "slug": "المكانسة"
          },
          {
            "name": "الغوازي",
            "slug": "الغوازي"
          },
          {
            "name": "أورتزاغ",
            "slug": "ا-ورتزاغ"
          },
          {
            "name": "كلاز",
            "slug": "كلاز"
          },
          {
            "name": "سيدي الحاج امحمد",
            "slug": "سيدي-الحاج-امحمد"
          },
          {
            "name": "سيدي يحيى بني زروال",
            "slug": "سيدي-يحيى-بني-زروال"
          },
          {
            "name": "ودكة",
            "slug": "ودكة"
          },
          {
            "name": "الرتبة",
            "slug": "الرتبة"
          },
          {
            "name": "البيبان",
            "slug": "البيبان"
          },
          {
            "name": "سيدي المخفي",
            "slug": "سيدي-المخفي-2"
          },
          {
            "name": "تمزكانة",
            "slug": "تمزكانة"
          },
          {
            "name": "كيسان",
            "slug": "كيسان"
          },
          {
            "name": "تبودة",
            "slug": "تبودة"
          },
          {
            "name": "تافرانت",
            "slug": "تافرانت"
          },
          {
            "name": "عين مديونة",
            "slug": "عين-مديونة"
          },
          {
            "name": "بني وليد",
            "slug": "بني-وليد"
          },
          {
            "name": "بوعادل",
            "slug": "بوعادل"
          },
          {
            "name": "بوهودة",
            "slug": "بوهودة"
          },
          {
            "name": "الزريزر",
            "slug": "الزريزر"
          },
          {
            "name": "الخلالفة",
            "slug": "الخلالفة"
          },
          {
            "name": "ارغيوة",
            "slug": "ارغيوة"
          },
          {
            "name": "مزراوة",
            "slug": "مزراوة"
          },
          {
            "name": "تمضيت",
            "slug": "تمضيت"
          },
          {
            "name": "بني ونجل تافراوت",
            "slug": "بني-ونجل-تافراوت"
          },
          {
            "name": "فناسة باب الحيط",
            "slug": "فناسة-باب-الحيط"
          },
          {
            "name": "البسابسا",
            "slug": "البسابسا"
          },
          {
            "name": "واد الجمعة",
            "slug": "واد-الجمعة"
          },
          {
            "name": "رأس الواد",
            "slug": "را-س-الواد"
          },
          {
            "name": "سيدي امحمد بن لحسن",
            "slug": "سيدي-امحمد-بن-لحسن"
          },
          {
            "name": "عين معطوف",
            "slug": "عين-معطوف"
          },
          {
            "name": "عين عائشة",
            "slug": "عين-عاي-شة"
          },
          {
            "name": "أولاد داود",
            "slug": "ا-ولاد-داود"
          },
          {
            "name": "بوعروس",
            "slug": "بوعروس"
          },
          {
            "name": "عين لكداح",
            "slug": "عين-لكداح"
          },
          {
            "name": "أولاد عياد",
            "slug": "ا-ولاد-عياد"
          },
          {
            "name": "مساسة",
            "slug": "مساسة"
          },
          {
            "name": "اوطابوعبان",
            "slug": "اوطابوعبان"
          }
        ]
      },
      {
        "name": "إقليم تازة",
        "slug": "ا-قليم-تازة",
        "communes": [
          {
            "name": "تازة",
            "slug": "تازة"
          },
          {
            "name": "تاهلة",
            "slug": "تاهلة"
          },
          {
            "name": "أكنول",
            "slug": "ا-كنول"
          },
          {
            "name": "واد أمليل",
            "slug": "واد-ا-مليل"
          },
          {
            "name": "بورد",
            "slug": "بورد"
          },
          {
            "name": "أجدير",
            "slug": "ا-جدير"
          },
          {
            "name": "اڭزناية الجنوبة",
            "slug": "اڭزناية-الجنوبة"
          },
          {
            "name": "اجبارنة",
            "slug": "اجبارنة"
          },
          {
            "name": "سيدي علي بورقبة",
            "slug": "سيدي-علي-بورقبة"
          },
          {
            "name": "تيزي وسلي",
            "slug": "تيزي-وسلي"
          },
          {
            "name": "آيت سغروشن",
            "slug": "ا-يت-سغروشن"
          },
          {
            "name": "تازارين",
            "slug": "تازارين"
          },
          {
            "name": "بويبلان",
            "slug": "بويبلان"
          },
          {
            "name": "مطماطة",
            "slug": "مطماطة"
          },
          {
            "name": "الصميعة",
            "slug": "الصميعة"
          },
          {
            "name": "الزراردة",
            "slug": "الزراردة"
          },
          {
            "name": "بني افتح",
            "slug": "بني-افتح"
          },
          {
            "name": "اترايبة",
            "slug": "اترايبة"
          },
          {
            "name": "الطايفة",
            "slug": "الطايفة"
          },
          {
            "name": "كاف الغار",
            "slug": "كاف-الغار"
          },
          {
            "name": "امسيلة",
            "slug": "امسيلة"
          },
          {
            "name": "برارحة",
            "slug": "برارحة"
          },
          {
            "name": "الڭوزات",
            "slug": "الڭوزات"
          },
          {
            "name": "تيناست",
            "slug": "تيناست"
          },
          {
            "name": "باب بودر",
            "slug": "باب-بودر"
          },
          {
            "name": "باب مرزوقة",
            "slug": "باب-مرزوقة"
          },
          {
            "name": "ڭلدمان",
            "slug": "ڭلدمان"
          },
          {
            "name": "مكناسة الغربية",
            "slug": "مكناسة-الغربية"
          },
          {
            "name": "مكناسة الشرقية",
            "slug": "مكناسة-الشرقية"
          },
          {
            "name": "بني لنث",
            "slug": "بني-لنث"
          },
          {
            "name": "أولاد الشريف",
            "slug": "ا-ولاد-الشريف"
          },
          {
            "name": "مغراوة",
            "slug": "مغراوة"
          },
          {
            "name": "أولاد ازباير",
            "slug": "ا-ولاد-ازباير"
          },
          {
            "name": "بوحلو",
            "slug": "بوحلو"
          },
          {
            "name": "بوشفاعة",
            "slug": "بوشفاعة"
          },
          {
            "name": "غياتة الغربية",
            "slug": "غياتة-الغربية"
          },
          {
            "name": "الربع الفوقي",
            "slug": "الربع-الفوقي"
          },
          {
            "name": "بني فراسن",
            "slug": "بني-فراسن"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة الرباط – سلا – القنيطرة",
    "slug": "جهة-الرباط-سلا-القنيطرة",
    "provinces": [
      {
        "name": "عمالة الرباط",
        "slug": "عمالة-الرباط",
        "communes": [
          {
            "name": "سيدي أبي القنادل",
            "slug": "سيدي-ا-بي-القنادل"
          },
          {
            "name": "السهول",
            "slug": "السهول"
          },
          {
            "name": "عامر",
            "slug": "عامر"
          }
        ]
      },
      {
        "name": "عمالة الصخيرات تمارة",
        "slug": "عمالة-الصخيرات-تمارة",
        "communes": [
          {
            "name": "تمارة",
            "slug": "تمارة"
          },
          {
            "name": "الهرهورة",
            "slug": "الهرهورة"
          },
          {
            "name": "الصخيرات",
            "slug": "الصخيرات"
          },
          {
            "name": "عين العودة",
            "slug": "عين-العودة"
          },
          {
            "name": "عين عتيق",
            "slug": "عين-عتيق"
          },
          {
            "name": "مرس الخير",
            "slug": "مرس-الخير"
          },
          {
            "name": "صباح",
            "slug": "صباح"
          },
          {
            "name": "المنزه",
            "slug": "المنزه"
          },
          {
            "name": "أم عزة",
            "slug": "ا-م-عزة"
          },
          {
            "name": "سيدي يحي زعير",
            "slug": "سيدي-يحي-زعير"
          }
        ]
      },
      {
        "name": "عمالة القنيطرة",
        "slug": "عمالة-القنيطرة",
        "communes": [
          {
            "name": "القنيطرة",
            "slug": "القنيطرة"
          },
          {
            "name": "سوق الأربعاء",
            "slug": "سوق-الا-ربعاء"
          },
          {
            "name": "مهدية",
            "slug": "مهدية"
          },
          {
            "name": "عامر السفلية",
            "slug": "عامر-السفلية"
          },
          {
            "name": "سيدي الطيبي",
            "slug": "سيدي-الطيبي"
          },
          {
            "name": "أولاد سلامة",
            "slug": "ا-ولاد-سلامة"
          },
          {
            "name": "الحدّادة",
            "slug": "الحد-ادة"
          },
          {
            "name": "المناصرة",
            "slug": "المناصرة"
          },
          {
            "name": "بنمنصور",
            "slug": "بنمنصور"
          },
          {
            "name": "سيدي محمد بنمنصور",
            "slug": "سيدي-محمد-بنمنصور"
          },
          {
            "name": "المڭرن",
            "slug": "المڭرن"
          },
          {
            "name": "عرباوة",
            "slug": "عرباوة"
          },
          {
            "name": "واد المخازن",
            "slug": "واد-المخازن"
          },
          {
            "name": "قرية بن عودة",
            "slug": "قرية-بن-عودة"
          },
          {
            "name": "بني مالك",
            "slug": "بني-مالك"
          },
          {
            "name": "سيدي علال التازي",
            "slug": "سيدي-علال-التازي"
          },
          {
            "name": "سوق ثلاثاء الغرب",
            "slug": "سوق-ثلاثاء-الغرب"
          },
          {
            "name": "بحارة أولاد عياد",
            "slug": "بحارة-ا-ولاد-عياد"
          },
          {
            "name": "سيدي محمد لحمر",
            "slug": "سيدي-محمد-لحمر"
          },
          {
            "name": "مولاي بوسلهام",
            "slug": "مولاي-بوسلهام"
          },
          {
            "name": "لالة ميمونة",
            "slug": "لالة-ميمونة"
          },
          {
            "name": "الشوافع",
            "slug": "الشوافع"
          },
          {
            "name": "سيدي بوبكر الحاج",
            "slug": "سيدي-بوبكر-الحاج"
          }
        ]
      },
      {
        "name": "إقليم الخميسات",
        "slug": "ا-قليم-الخميسات",
        "communes": [
          {
            "name": "الخميسات",
            "slug": "الخميسات"
          },
          {
            "name": "الرماني",
            "slug": "الرماني"
          },
          {
            "name": "تيفلت",
            "slug": "تيفلت"
          },
          {
            "name": "سيدي علال البحراوي",
            "slug": "سيدي-علال-البحراوي"
          },
          {
            "name": "ايت ميمون",
            "slug": "ايت-ميمون"
          },
          {
            "name": "ايت أوريبل",
            "slug": "ايت-ا-وريبل"
          },
          {
            "name": "مجمع الطلبة",
            "slug": "مجمع-الطلبة"
          },
          {
            "name": "الكنزرة",
            "slug": "الكنزرة"
          },
          {
            "name": "ايت يدين",
            "slug": "ايت-يدين"
          },
          {
            "name": "الصفاصيف",
            "slug": "الصفاصيف"
          },
          {
            "name": "ايت سيبرن",
            "slug": "ايت-سيبرن"
          },
          {
            "name": "سيدي علال المصدر",
            "slug": "سيدي-علال-المصدر"
          },
          {
            "name": "سيدي الغندور",
            "slug": "سيدي-الغندور"
          },
          {
            "name": "حودران",
            "slug": "حودران"
          },
          {
            "name": "المعازيز",
            "slug": "المعازيز"
          },
          {
            "name": "ايت إيكو",
            "slug": "ايت-ا-يكو"
          },
          {
            "name": "بوقشمير",
            "slug": "بوقشمير"
          },
          {
            "name": "أيت إيشو",
            "slug": "ا-يت-ا-يشو"
          },
          {
            "name": "اولماس",
            "slug": "اولماس"
          },
          {
            "name": "تيداس",
            "slug": "تيداس"
          },
          {
            "name": "البراشوة",
            "slug": "البراشوة"
          },
          {
            "name": "مولاي ادريس أغبال",
            "slug": "مولاي-ادريس-ا-غبال"
          },
          {
            "name": "جمعة مول البلاد",
            "slug": "جمعة-مول-البلاد"
          },
          {
            "name": "الغوالم",
            "slug": "الغوالم"
          },
          {
            "name": "مرشوش",
            "slug": "مرشوش"
          },
          {
            "name": "عين السبيت",
            "slug": "عين-السبيت"
          },
          {
            "name": "الزحيلكة",
            "slug": "الزحيلكة"
          },
          {
            "name": "مقام الطلبة",
            "slug": "مقام-الطلبة"
          },
          {
            "name": "سيدي عبد الرزاق",
            "slug": "سيدي-عبد-الرزاق"
          },
          {
            "name": "ايت مالك",
            "slug": "ايت-مالك"
          },
          {
            "name": "ايت إعلي ولحسن",
            "slug": "ايت-ا-علي-ولحسن"
          },
          {
            "name": "عين الجوهرة -سيدي بوخلخال",
            "slug": "عين-الجوهرة-سيدي-بوخلخال"
          },
          {
            "name": "أيت بلقاسم",
            "slug": "ا-يت-بلقاسم"
          },
          {
            "name": "خميس سيدي يحيى",
            "slug": "خميس-سيدي-يحيى"
          },
          {
            "name": "ايت بويحيى الحجامة",
            "slug": "ايت-بويحيى-الحجامة"
          }
        ]
      },
      {
        "name": "إقليم سيدي قاسم",
        "slug": "ا-قليم-سيدي-قاسم",
        "communes": [
          {
            "name": "سيدي قاسم",
            "slug": "سيدي-قاسم"
          },
          {
            "name": "مشرع بلقصيري",
            "slug": "مشرع-بلقصيري"
          },
          {
            "name": "أحد كورت",
            "slug": "ا-حد-كورت"
          },
          {
            "name": "جرف الملحة",
            "slug": "جرف-الملحة"
          },
          {
            "name": "دار الڭداري",
            "slug": "دار-الڭداري"
          },
          {
            "name": "بني وال",
            "slug": "بني-وال"
          },
          {
            "name": "عين الدفالي",
            "slug": "عين-الدفالي"
          },
          {
            "name": "مولاي عبد القادر",
            "slug": "مولاي-عبد-القادر"
          },
          {
            "name": "سيدي عزوز",
            "slug": "سيدي-عزوز"
          },
          {
            "name": "سيدي احمد بنعيسى",
            "slug": "سيدي-احمد-بنعيسى"
          },
          {
            "name": "سيدي اعمر الحاضي",
            "slug": "سيدي-اعمر-الحاضي"
          },
          {
            "name": "لمرابيح",
            "slug": "لمرابيح"
          },
          {
            "name": "توغيلت",
            "slug": "توغيلت"
          },
          {
            "name": "الخنيشات",
            "slug": "الخنيشات"
          },
          {
            "name": "أولاد نوال",
            "slug": "ا-ولاد-نوال"
          },
          {
            "name": "سيدي امحمد الشلح",
            "slug": "سيدي-امحمد-الشلح"
          },
          {
            "name": "سيدي الكامل",
            "slug": "سيدي-الكامل"
          },
          {
            "name": "ارميلات",
            "slug": "ارميلات"
          },
          {
            "name": "دار العسلوجي",
            "slug": "دار-العسلوجي"
          },
          {
            "name": "انويرات",
            "slug": "انويرات"
          },
          {
            "name": "الحوافات",
            "slug": "الحوافات"
          },
          {
            "name": "صفصاف",
            "slug": "صفصاف"
          },
          {
            "name": "باب تيوكا",
            "slug": "باب-تيوكا"
          },
          {
            "name": "زيرارة",
            "slug": "زيرارة"
          },
          {
            "name": "اشبانات",
            "slug": "اشبانات"
          },
          {
            "name": "زكوطة",
            "slug": "زكوطة"
          },
          {
            "name": "سلفات",
            "slug": "سلفات"
          },
          {
            "name": "بير الطالب",
            "slug": "بير-الطالب"
          },
          {
            "name": "ثكنة",
            "slug": "ثكنة"
          }
        ]
      },
      {
        "name": "إقليم سيدي سليمان",
        "slug": "ا-قليم-سيدي-سليمان",
        "communes": [
          {
            "name": "سيدي سليمان",
            "slug": "سيدي-سليمان"
          },
          {
            "name": "سيدي يحيى الغرب",
            "slug": "سيدي-يحيى-الغرب"
          },
          {
            "name": "بومعيز",
            "slug": "بومعيز"
          },
          {
            "name": "دار بلعمري",
            "slug": "دار-بلعمري"
          },
          {
            "name": "أزغار",
            "slug": "ا-زغار"
          },
          {
            "name": "أولاد بن حمادي",
            "slug": "ا-ولاد-بن-حمادي"
          },
          {
            "name": "المساعدة",
            "slug": "المساعدة"
          },
          {
            "name": "أولاد حسين",
            "slug": "ا-ولاد-حسين"
          },
          {
            "name": "الصفافعة",
            "slug": "الصفافعة"
          },
          {
            "name": "القصيبية",
            "slug": "القصيبية"
          },
          {
            "name": "عامر الشمالية",
            "slug": "عامر-الشمالية"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة بني ملال – خنيفرة",
    "slug": "جهة-بني-ملال-خنيفرة",
    "provinces": [
      {
        "name": "عمالة إقليم بني ملال",
        "slug": "عمالة-ا-قليم-بني-ملال",
        "communes": [
          {
            "name": "بني ملال",
            "slug": "بني-ملال"
          },
          {
            "name": "قصبة تادلة",
            "slug": "قصبة-تادلة"
          },
          {
            "name": "زاوية الشيخ",
            "slug": "زاوية-الشيخ"
          },
          {
            "name": "القصيبة",
            "slug": "القصيبة"
          },
          {
            "name": "أولاد ڭناو",
            "slug": "ا-ولاد-ڭناو"
          },
          {
            "name": "أولاد امبارك",
            "slug": "ا-ولاد-امبارك"
          },
          {
            "name": "فم اودي",
            "slug": "فم-اودي"
          },
          {
            "name": "أولاد ايعيش",
            "slug": "ا-ولاد-ايعيش"
          },
          {
            "name": "سيدي جابر",
            "slug": "سيدي-جابر"
          },
          {
            "name": "فم العنصر",
            "slug": "فم-العنصر"
          },
          {
            "name": "ناوور",
            "slug": "ناوور"
          },
          {
            "name": "دير القصيبة",
            "slug": "دير-القصيبة"
          },
          {
            "name": "تانوغة",
            "slug": "تانوغة"
          },
          {
            "name": "تاڭزيرت",
            "slug": "تاڭزيرت"
          },
          {
            "name": "آيت أم البخث",
            "slug": "ا-يت-ا-م-البخث"
          },
          {
            "name": "اغبالة",
            "slug": "اغبالة"
          },
          {
            "name": "تيزي نيسلي",
            "slug": "تيزي-نيسلي"
          },
          {
            "name": "بوتفردة",
            "slug": "بوتفردة"
          },
          {
            "name": "ڭطاية",
            "slug": "ڭطاية"
          },
          {
            "name": "سمڭت",
            "slug": "سمڭت"
          },
          {
            "name": "أولاد يوسف",
            "slug": "ا-ولاد-يوسف"
          },
          {
            "name": "أولاد سعيد الواد",
            "slug": "ا-ولاد-سعيد-الواد"
          }
        ]
      },
      {
        "name": "إقليم اًزيلال",
        "slug": "ا-قليم-ا-زيلال",
        "communes": [
          {
            "name": "أزيلال",
            "slug": "ا-زيلال"
          },
          {
            "name": "دمنات",
            "slug": "دمنات"
          },
          {
            "name": "آيت امحمد",
            "slug": "ا-يت-امحمد"
          },
          {
            "name": "آيت عباس",
            "slug": "ا-يت-عباس"
          },
          {
            "name": "تبانت",
            "slug": "تبانت"
          },
          {
            "name": "ايت بواولي",
            "slug": "ايت-بواولي"
          },
          {
            "name": "أڭودي نلخير",
            "slug": "ا-ڭودي-نلخير"
          },
          {
            "name": "تامدا نومرصيد",
            "slug": "تامدا-نومرصيد"
          },
          {
            "name": "زاوية أحنصال",
            "slug": "زاوية-ا-حنصال"
          },
          {
            "name": "تسقي",
            "slug": "تسقي"
          },
          {
            "name": "تاونزا",
            "slug": "تاونزا"
          },
          {
            "name": "مولاي عيسى بن إدريس",
            "slug": "مولاي-عيسى-بن-ا-دريس"
          },
          {
            "name": "بزو",
            "slug": "بزو"
          },
          {
            "name": "ارفالة",
            "slug": "ارفالة"
          },
          {
            "name": "آيت تڭلا",
            "slug": "ا-يت-تڭلا"
          },
          {
            "name": "تنانت",
            "slug": "تنانت"
          },
          {
            "name": "فم الجمعة",
            "slug": "فم-الجمعة"
          },
          {
            "name": "تابية",
            "slug": "تابية"
          },
          {
            "name": "بني حسان",
            "slug": "بني-حسان"
          },
          {
            "name": "واولى",
            "slug": "واولى"
          },
          {
            "name": "آيت ماجدن",
            "slug": "ا-يت-ماجدن"
          },
          {
            "name": "تفني",
            "slug": "تفني"
          },
          {
            "name": "امليل",
            "slug": "امليل"
          },
          {
            "name": "سيدي بولخلف",
            "slug": "سيدي-بولخلف"
          },
          {
            "name": "آيت ابلال",
            "slug": "ا-يت-ابلال"
          },
          {
            "name": "آيت أومديس",
            "slug": "ا-يت-ا-ومديس"
          },
          {
            "name": "آيت تمليل",
            "slug": "ا-يت-تمليل"
          },
          {
            "name": "أنزو",
            "slug": "ا-نزو"
          },
          {
            "name": "تدلي فطواكة",
            "slug": "تدلي-فطواكة"
          },
          {
            "name": "سيدي يعقوب",
            "slug": "سيدي-يعقوب"
          },
          {
            "name": "أنرڭي",
            "slug": "ا-نرڭي"
          },
          {
            "name": "بين الويدان",
            "slug": "بين-الويدان"
          },
          {
            "name": "إسكسي",
            "slug": "ا-سكسي"
          },
          {
            "name": "واويزغت",
            "slug": "واويزغت"
          },
          {
            "name": "تيفرت نآيت حمزة",
            "slug": "تيفرت-نا-يت-حمزة"
          },
          {
            "name": "آيت اوقبلي",
            "slug": "ا-يت-اوقبلي"
          },
          {
            "name": "تاڭلفت",
            "slug": "تاڭلفت"
          },
          {
            "name": "تبروشت",
            "slug": "تبروشت"
          },
          {
            "name": "آيت مزيغ",
            "slug": "ا-يت-مزيغ"
          },
          {
            "name": "تيلوڭيت",
            "slug": "تيلوڭيت"
          },
          {
            "name": "أفورار",
            "slug": "ا-فورار"
          },
          {
            "name": "تيموليلت",
            "slug": "تيموليلت"
          },
          {
            "name": "ايت و عرضى",
            "slug": "ايت-و-عرضى"
          },
          {
            "name": "بني عياط",
            "slug": "بني-عياط"
          }
        ]
      },
      {
        "name": "اقليم الفقيه بنصالح",
        "slug": "اقليم-الفقيه-بنصالح",
        "communes": [
          {
            "name": "الفقيه بن صالح",
            "slug": "الفقيه-بن-صالح"
          },
          {
            "name": "سوق السبت أولاد النمة",
            "slug": "سوق-السبت-ا-ولاد-النمة"
          },
          {
            "name": "اولاد عياد",
            "slug": "اولاد-عياد"
          },
          {
            "name": "سيدي حمادي",
            "slug": "سيدي-حمادي"
          },
          {
            "name": "أولاد بورحمون",
            "slug": "ا-ولاد-بورحمون"
          },
          {
            "name": "سيدي عيسى بن علي",
            "slug": "سيدي-عيسى-بن-علي"
          },
          {
            "name": "أولاد زمام",
            "slug": "ا-ولاد-زمام"
          },
          {
            "name": "كريفات",
            "slug": "كريفات"
          },
          {
            "name": "اهل مربع",
            "slug": "اهل-مربع"
          },
          {
            "name": "الخلفية",
            "slug": "الخلفية"
          },
          {
            "name": "برادية",
            "slug": "برادية"
          },
          {
            "name": "بني شڭدال",
            "slug": "بني-شڭدال"
          },
          {
            "name": "بني وكيل",
            "slug": "بني-وكيل"
          },
          {
            "name": "دار ولد زيدوح",
            "slug": "دار-ولد-زيدوح"
          },
          {
            "name": "أحد بوموسى",
            "slug": "ا-حد-بوموسى"
          },
          {
            "name": "أولاد ناصر",
            "slug": "ا-ولاد-ناصر"
          }
        ]
      },
      {
        "name": "إقليم خنيفرة",
        "slug": "ا-قليم-خنيفرة",
        "communes": [
          {
            "name": "خنيفرة",
            "slug": "خنيفرة"
          },
          {
            "name": "مريرت",
            "slug": "مريرت"
          },
          {
            "name": "واو مانة",
            "slug": "واو-مانة"
          },
          {
            "name": "آيت إسحاق",
            "slug": "ا-يت-ا-سحاق"
          },
          {
            "name": "ا لقباب",
            "slug": "ا-لقباب"
          },
          {
            "name": "سيدي يحيى أو ساعد",
            "slug": "سيدي-يحيى-ا-و-ساعد"
          },
          {
            "name": "تيغسالين",
            "slug": "تيغسالين"
          },
          {
            "name": "آيت سعدلي",
            "slug": "ا-يت-سعدلي"
          },
          {
            "name": "كروشن",
            "slug": "كروشن"
          },
          {
            "name": "سيدي عمرو",
            "slug": "سيدي-عمرو"
          },
          {
            "name": "سيدي لامين",
            "slug": "سيدي-لامين"
          },
          {
            "name": "البرج",
            "slug": "البرج"
          },
          {
            "name": "موحى أو حمو الزياني",
            "slug": "موحى-ا-و-حمو-الزياني"
          },
          {
            "name": "أكلمام أزكزا",
            "slug": "ا-كلمام-ا-زكزا"
          },
          {
            "name": "لهري",
            "slug": "لهري"
          },
          {
            "name": "سيدي حسين",
            "slug": "سيدي-حسين"
          },
          {
            "name": "أكلموس",
            "slug": "ا-كلموس"
          },
          {
            "name": "احد بوحسوسن",
            "slug": "احد-بوحسوسن"
          },
          {
            "name": "مولاي بوعزة",
            "slug": "مولاي-بوعزة"
          },
          {
            "name": "سبت ايت رحو",
            "slug": "سبت-ايت-رحو"
          },
          {
            "name": "ام الربيع",
            "slug": "ام-الربيع"
          },
          {
            "name": "الحمام",
            "slug": "الحمام"
          }
        ]
      },
      {
        "name": "إقليم خريبكة",
        "slug": "ا-قليم-خريبكة",
        "communes": [
          {
            "name": "خريبكة",
            "slug": "خريبكة"
          },
          {
            "name": "وادي زم",
            "slug": "وادي-زم"
          },
          {
            "name": "أبي الجعد",
            "slug": "ا-بي-الجعد"
          },
          {
            "name": "بوجنيبة",
            "slug": "بوجنيبة"
          },
          {
            "name": "حطان",
            "slug": "حطان"
          },
          {
            "name": "الرواشد",
            "slug": "الرواشد"
          },
          {
            "name": "الشڭران",
            "slug": "الشڭران"
          },
          {
            "name": "تشرافت",
            "slug": "تشرافت"
          },
          {
            "name": "عين قيشر",
            "slug": "عين-قيشر"
          },
          {
            "name": "بني بتاو",
            "slug": "بني-بتاو"
          },
          {
            "name": "بوخريص",
            "slug": "بوخريص"
          },
          {
            "name": "بني زرنتل",
            "slug": "بني-زرنتل"
          },
          {
            "name": "أولاد ڭواوش",
            "slug": "ا-ولاد-ڭواوش"
          },
          {
            "name": "بني يخلف",
            "slug": "بني-يخلف"
          },
          {
            "name": "لڭفاف",
            "slug": "لڭفاف"
          },
          {
            "name": "بولنوار",
            "slug": "بولنوار"
          },
          {
            "name": "بئر مزوي",
            "slug": "بي-ر-مزوي"
          },
          {
            "name": "الفقراء",
            "slug": "الفقراء"
          },
          {
            "name": "المفاسيس",
            "slug": "المفاسيس"
          },
          {
            "name": "أولاد عبدون",
            "slug": "ا-ولاد-عبدون"
          },
          {
            "name": "أولاد عزوز",
            "slug": "ا-ولاد-عزوز"
          },
          {
            "name": "آيت عمار",
            "slug": "ا-يت-عمار"
          },
          {
            "name": "أولاد فتاتة",
            "slug": "ا-ولاد-فتاتة"
          },
          {
            "name": "لڭناديز",
            "slug": "لڭناديز"
          },
          {
            "name": "أولاد بوغادي",
            "slug": "ا-ولاد-بوغادي"
          },
          {
            "name": "بني سمير",
            "slug": "بني-سمير"
          },
          {
            "name": "قصبة الطرش",
            "slug": "قصبة-الطرش"
          },
          {
            "name": "لمعادنة",
            "slug": "لمعادنة"
          },
          {
            "name": "أولاد فنان",
            "slug": "ا-ولاد-فنان"
          },
          {
            "name": "ا لبراكسة",
            "slug": "ا-لبراكسة"
          },
          {
            "name": "أولاد عيسى",
            "slug": "ا-ولاد-عيسى"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة الدار البيضاء - سطات",
    "slug": "جهة-الدار-البيضاء-سطات",
    "provinces": [
      {
        "name": "عمالة المحمدية",
        "slug": "عمالة-المحمدية",
        "communes": [
          {
            "name": "المحمدية",
            "slug": "المحمدية"
          },
          {
            "name": "عين حرودة",
            "slug": "عين-حرودة"
          },
          {
            "name": "بني يخلف",
            "slug": "بني-يخلف-2"
          },
          {
            "name": "سيدي موسى بن علي",
            "slug": "سيدي-موسى-بن-علي"
          },
          {
            "name": "سيدي موسى المجذوب",
            "slug": "سيدي-موسى-المجذوب"
          },
          {
            "name": "الشلالات",
            "slug": "الشلالات"
          }
        ]
      },
      {
        "name": "عمالة الجديدة",
        "slug": "عمالة-الجديدة",
        "communes": [
          {
            "name": "الجديدة",
            "slug": "الجديدة"
          },
          {
            "name": "أزمّور",
            "slug": "ا-زم-ور"
          },
          {
            "name": "لبير الجديد",
            "slug": "لبير-الجديد"
          },
          {
            "name": "لمهارزة الساحل",
            "slug": "لمهارزة-الساحل"
          },
          {
            "name": "لغديرة",
            "slug": "لغديرة"
          },
          {
            "name": "سيدي علي بن حمدوش",
            "slug": "سيدي-علي-بن-حمدوش"
          },
          {
            "name": "شتوكة",
            "slug": "شتوكة"
          },
          {
            "name": "حوزية",
            "slug": "حوزية"
          },
          {
            "name": "أولاد رحمون",
            "slug": "ا-ولاد-رحمون"
          },
          {
            "name": "مولاي عبد الله",
            "slug": "مولاي-عبد-الله"
          },
          {
            "name": "أولاد حسين",
            "slug": "ا-ولاد-حسين-2"
          },
          {
            "name": "سيدي امحمد اخديم",
            "slug": "سيدي-امحمد-اخديم"
          },
          {
            "name": "أولاد غانم",
            "slug": "ا-ولاد-غانم"
          },
          {
            "name": "سيدي عابد",
            "slug": "سيدي-عابد"
          },
          {
            "name": "أولاد عيسى",
            "slug": "ا-ولاد-عيسى-2"
          },
          {
            "name": "أولاد سيدي علي بن يوسف",
            "slug": "ا-ولاد-سيدي-علي-بن-يوسف"
          },
          {
            "name": "أولاد فريج",
            "slug": "ا-ولاد-فريج"
          },
          {
            "name": "زاوية لقواسم",
            "slug": "زاوية-لقواسم"
          },
          {
            "name": "سي احساين بن عبد الرحمان",
            "slug": "سي-احساين-بن-عبد-الرحمان"
          },
          {
            "name": "شعيبات",
            "slug": "شعيبات"
          },
          {
            "name": "أولاد حمدان",
            "slug": "ا-ولاد-حمدان"
          },
          {
            "name": "متوح",
            "slug": "متوح"
          },
          {
            "name": "بولعوان",
            "slug": "بولعوان"
          },
          {
            "name": "مڭرس",
            "slug": "مڭرس"
          },
          {
            "name": "سيدي إسماعيل",
            "slug": "سيدي-ا-سماعيل"
          },
          {
            "name": "سبت سايس",
            "slug": "سبت-سايس"
          },
          {
            "name": "زاوية سايس",
            "slug": "زاوية-سايس"
          }
        ]
      },
      {
        "name": "إقليم النواصر",
        "slug": "ا-قليم-النواصر",
        "communes": [
          {
            "name": "النواصر",
            "slug": "النواصر"
          },
          {
            "name": "بوسكورة",
            "slug": "بوسكورة"
          },
          {
            "name": "دار بوعزة",
            "slug": "دار-بوعزة"
          },
          {
            "name": "أولاد عزوز",
            "slug": "ا-ولاد-عزوز-2"
          },
          {
            "name": "أولاد صالح",
            "slug": "ا-ولاد-صالح"
          }
        ]
      },
      {
        "name": "إقليم مديونة",
        "slug": "ا-قليم-مديونة",
        "communes": [
          {
            "name": "تيط مليل",
            "slug": "تيط-مليل"
          },
          {
            "name": "مديونة",
            "slug": "مديونة"
          },
          {
            "name": "لهراويين",
            "slug": "لهراويين"
          },
          {
            "name": "سيدي حجاج واد حصار",
            "slug": "سيدي-حجاج-واد-حصار"
          },
          {
            "name": "المجاطية أولاد الطالب",
            "slug": "المجاطية-ا-ولاد-الطالب"
          }
        ]
      },
      {
        "name": "إقليم بنسليمان",
        "slug": "ا-قليم-بنسليمان",
        "communes": [
          {
            "name": "بنسليمان",
            "slug": "بنسليمان"
          },
          {
            "name": "بوزنيقة",
            "slug": "بوزنيقة"
          },
          {
            "name": "المنصورية",
            "slug": "المنصورية"
          },
          {
            "name": "فضالات",
            "slug": "فضالات"
          },
          {
            "name": "ولاد يحيى لوطا",
            "slug": "ولاد-يحيى-لوطا"
          },
          {
            "name": "موالين الواد",
            "slug": "موالين-الواد"
          },
          {
            "name": "احلاف",
            "slug": "احلاف"
          },
          {
            "name": "الردادنة أولاد مالك",
            "slug": "الردادنة-ا-ولاد-مالك"
          },
          {
            "name": "مليلة",
            "slug": "مليلة"
          },
          {
            "name": "أولاد علي الطوالع",
            "slug": "ا-ولاد-علي-الطوالع"
          },
          {
            "name": "ال زيايدة",
            "slug": "ال-زيايدة"
          },
          {
            "name": "عين تيزغة",
            "slug": "عين-تيزغة"
          },
          {
            "name": "شراط",
            "slug": "شراط"
          },
          {
            "name": "سيدي بطاش",
            "slug": "سيدي-بطاش"
          },
          {
            "name": "بئر النصر",
            "slug": "بي-ر-النصر"
          }
        ]
      },
      {
        "name": "إقليم برشيد",
        "slug": "ا-قليم-برشيد",
        "communes": [
          {
            "name": "برشيد",
            "slug": "برشيد"
          },
          {
            "name": "الڭارة",
            "slug": "الڭارة"
          },
          {
            "name": "أولاد عبو",
            "slug": "ا-ولاد-عبو"
          },
          {
            "name": "سيدي رحال الشاطئ",
            "slug": "سيدي-رحال-الشاطي"
          },
          {
            "name": "حد السوالم",
            "slug": "حد-السوالم"
          },
          {
            "name": "الدروة",
            "slug": "الدروة"
          },
          {
            "name": "لحساسنة",
            "slug": "لحساسنة"
          },
          {
            "name": "سيدي المكي",
            "slug": "سيدي-المكي"
          },
          {
            "name": "زاوية سيدي بنحمدون",
            "slug": "زاوية-سيدي-بنحمدون"
          },
          {
            "name": "لغنيميين",
            "slug": "لغنيميين"
          },
          {
            "name": "بن معاشو",
            "slug": "بن-معاشو"
          },
          {
            "name": "سيدي عبد الخالق",
            "slug": "سيدي-عبد-الخالق"
          },
          {
            "name": "الساحل أولاد احريز‏",
            "slug": "الساحل-ا-ولاد-احريز"
          },
          {
            "name": "ال سوالم الطريفية",
            "slug": "ال-سوالم-الطريفية"
          },
          {
            "name": "أولاد زيدان",
            "slug": "ا-ولاد-زيدان"
          },
          {
            "name": "قصبة بن مشيش",
            "slug": "قصبة-بن-مشيش"
          },
          {
            "name": "جاقمة",
            "slug": "جاقمة"
          },
          {
            "name": "لمباركيين",
            "slug": "لمباركيين"
          },
          {
            "name": "رياح",
            "slug": "رياح"
          },
          {
            "name": "الفقرا أولاد عمرو",
            "slug": "الفقرا-ا-ولاد-عمرو"
          },
          {
            "name": "أولاد صباح ‏",
            "slug": "ا-ولاد-صباح"
          },
          {
            "name": "أولاد زيدان",
            "slug": "ا-ولاد-زيدان-2"
          }
        ]
      },
      {
        "name": "إقليم السطات",
        "slug": "ا-قليم-السطات",
        "communes": [
          {
            "name": "سطات",
            "slug": "سطات"
          },
          {
            "name": "بن أحمد",
            "slug": "بن-ا-حمد"
          },
          {
            "name": "لولاد",
            "slug": "لولاد"
          },
          {
            "name": "أولاد امراح",
            "slug": "ا-ولاد-امراح"
          },
          {
            "name": "البروج",
            "slug": "البروج"
          },
          {
            "name": "انخيلة",
            "slug": "انخيلة"
          },
          {
            "name": "لخزازرة",
            "slug": "لخزازرة"
          },
          {
            "name": "مكارطو",
            "slug": "مكارطو"
          },
          {
            "name": "سيدي الذهبي",
            "slug": "سيدي-الذهبي"
          },
          {
            "name": "أولاد امحمد",
            "slug": "ا-ولاد-امحمد"
          },
          {
            "name": "عين الضربان-لحلاف",
            "slug": "عين-الضربان-لحلاف"
          },
          {
            "name": "بوكركوح",
            "slug": "بوكركوح"
          },
          {
            "name": "سيدي عبد الكريم",
            "slug": "سيدي-عبد-الكريم"
          },
          {
            "name": "منيع",
            "slug": "منيع"
          },
          {
            "name": "سيدي حجاج",
            "slug": "سيدي-حجاج"
          },
          {
            "name": "أولاد فارس",
            "slug": "ا-ولاد-فارس"
          },
          {
            "name": "مريزيك",
            "slug": "مريزيك"
          },
          {
            "name": "السكامنة",
            "slug": "السكامنة"
          },
          {
            "name": "أولاد شبانة",
            "slug": "ا-ولاد-شبانة"
          },
          {
            "name": "واد النعناع",
            "slug": "واد-النعناع"
          },
          {
            "name": "راس العين الشاوية",
            "slug": "راس-العين-الشاوية"
          },
          {
            "name": "أولاد فارس الحلة",
            "slug": "ا-ولاد-فارس-الحلة"
          },
          {
            "name": "أولاد بوعلي النواجة",
            "slug": "ا-ولاد-بوعلي-النواجة"
          },
          {
            "name": "مسكورة",
            "slug": "مسكورة"
          },
          {
            "name": "أولاد عامر",
            "slug": "ا-ولاد-عامر"
          },
          {
            "name": "لقراقرة",
            "slug": "لقراقرة"
          },
          {
            "name": "بني خلوك",
            "slug": "بني-خلوك"
          },
          {
            "name": "سيدي بومهدي",
            "slug": "سيدي-بومهدي"
          },
          {
            "name": "سيدي احمد الخدير",
            "slug": "سيدي-احمد-الخدير"
          },
          {
            "name": "عين بلال",
            "slug": "عين-بلال"
          },
          {
            "name": "أولاد افريحة",
            "slug": "ا-ولاد-افريحة"
          },
          {
            "name": "دار الشافعي",
            "slug": "دار-الشافعي"
          },
          {
            "name": "سيدي العايدي",
            "slug": "سيدي-العايدي"
          },
          {
            "name": "مزامزة الجنوبية",
            "slug": "مزامزة-الجنوبية"
          },
          {
            "name": "كيسر",
            "slug": "كيسر"
          },
          {
            "name": "ريما",
            "slug": "ريما"
          },
          {
            "name": "أولاد الصغير",
            "slug": "ا-ولاد-الصغير"
          },
          {
            "name": "بني يكرين",
            "slug": "بني-يكرين"
          },
          {
            "name": "الثوالث",
            "slug": "الثوالث"
          },
          {
            "name": "مشرع بن عبو",
            "slug": "مشرع-بن-عبو"
          },
          {
            "name": "سيدي محمد بن رحال",
            "slug": "سيدي-محمد-بن-رحال"
          },
          {
            "name": "اخميسات الشاوية",
            "slug": "اخميسات-الشاوية"
          },
          {
            "name": "أولاد سعيد",
            "slug": "ا-ولاد-سعيد"
          },
          {
            "name": "لحوازة",
            "slug": "لحوازة"
          },
          {
            "name": "امزورة",
            "slug": "امزورة"
          },
          {
            "name": "كدانة",
            "slug": "كدانة"
          }
        ]
      },
      {
        "name": "إقليم سيدي بنور",
        "slug": "ا-قليم-سيدي-بنور",
        "communes": [
          {
            "name": "سيدي بنور",
            "slug": "سيدي-بنور"
          },
          {
            "name": "الزمامرة",
            "slug": "الزمامرة"
          },
          {
            "name": "لعامرية",
            "slug": "لعامرية"
          },
          {
            "name": "بني هلال",
            "slug": "بني-هلال"
          },
          {
            "name": "لمشرك",
            "slug": "لمشرك"
          },
          {
            "name": "أولاد سي بويحيى",
            "slug": "ا-ولاد-سي-بويحيى"
          },
          {
            "name": "بني تسيريس",
            "slug": "بني-تسيريس"
          },
          {
            "name": "لعونات",
            "slug": "لعونات"
          },
          {
            "name": "مطران",
            "slug": "مطران"
          },
          {
            "name": "أولاد بوساكن",
            "slug": "ا-ولاد-بوساكن"
          },
          {
            "name": "خميس القصيبة",
            "slug": "خميس-القصيبة"
          },
          {
            "name": "كرديد",
            "slug": "كرديد"
          },
          {
            "name": "لعكاكشة",
            "slug": "لعكاكشة"
          },
          {
            "name": "كدية بني دغوغ",
            "slug": "كدية-بني-دغوغ"
          },
          {
            "name": "تامدة",
            "slug": "تامدة"
          },
          {
            "name": "أولاد عمران",
            "slug": "ا-ولاد-عمران"
          },
          {
            "name": "لعطاطرة",
            "slug": "لعطاطرة"
          },
          {
            "name": "بوحمام",
            "slug": "بوحمام"
          },
          {
            "name": "جابرية",
            "slug": "جابرية"
          },
          {
            "name": "امطل",
            "slug": "امطل"
          },
          {
            "name": "الوليدية",
            "slug": "الوليدية"
          },
          {
            "name": "الغربية",
            "slug": "الغربية"
          },
          {
            "name": "أولاد سبيطة",
            "slug": "ا-ولاد-سبيطة"
          },
          {
            "name": "الغنادرة",
            "slug": "الغنادرة"
          },
          {
            "name": "سانية بركيك",
            "slug": "سانية-بركيك"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة مراكش – اسفي",
    "slug": "جهة-مراكش-اسفي",
    "provinces": [
      {
        "name": "عمالة مراكش",
        "slug": "عمالة-مراكش",
        "communes": [
          {
            "name": "مراكش",
            "slug": "مراكش"
          },
          {
            "name": "مشور-القصبة",
            "slug": "مشور-القصبة"
          },
          {
            "name": "الاوداية",
            "slug": "الاوداية"
          },
          {
            "name": "ايت ايمور",
            "slug": "ايت-ايمور"
          },
          {
            "name": "اكفاي",
            "slug": "اكفاي"
          },
          {
            "name": "سيد الزوين",
            "slug": "سيد-الزوين"
          },
          {
            "name": "السويهلة",
            "slug": "السويهلة"
          },
          {
            "name": "تسلطانت",
            "slug": "تسلطانت"
          },
          {
            "name": "سعادة",
            "slug": "سعادة"
          },
          {
            "name": "حربيل",
            "slug": "حربيل"
          },
          {
            "name": "المنابهة",
            "slug": "المنابهة"
          },
          {
            "name": "أولاد دليم",
            "slug": "ا-ولاد-دليم"
          },
          {
            "name": "واحة سيدي ابراهيم",
            "slug": "واحة-سيدي-ابراهيم"
          },
          {
            "name": "الويدان",
            "slug": "الويدان"
          },
          {
            "name": "أولاد حسون",
            "slug": "ا-ولاد-حسون"
          }
        ]
      },
      {
        "name": "إقليم شيشاوة",
        "slug": "ا-قليم-شيشاوة",
        "communes": [
          {
            "name": "شيشاوة",
            "slug": "شيشاوة"
          },
          {
            "name": "امنتانوت",
            "slug": "امنتانوت"
          },
          {
            "name": "ايت هادي",
            "slug": "ايت-هادي"
          },
          {
            "name": "سيدي بوزيد الركراكي",
            "slug": "سيدي-بوزيد-الركراكي"
          },
          {
            "name": "لمزوضية",
            "slug": "لمزوضية"
          },
          {
            "name": "أولاد مومنة",
            "slug": "ا-ولاد-مومنة"
          },
          {
            "name": "سيدي المختار",
            "slug": "سيدي-المختار"
          },
          {
            "name": "اهديل",
            "slug": "اهديل"
          },
          {
            "name": "سيدي امحمد دليل",
            "slug": "سيدي-امحمد-دليل"
          },
          {
            "name": "السعيدات",
            "slug": "السعيدات"
          },
          {
            "name": "نفيفة",
            "slug": "نفيفة"
          },
          {
            "name": "واد البور",
            "slug": "واد-البور"
          },
          {
            "name": "أفلا ايسن",
            "slug": "ا-فلا-ايسن"
          },
          {
            "name": "تمزكدوين",
            "slug": "تمزكدوين"
          },
          {
            "name": "إروهالن",
            "slug": "ا-روهالن"
          },
          {
            "name": "عين تزيتونت",
            "slug": "عين-تزيتونت"
          },
          {
            "name": "سيدي غانم",
            "slug": "سيدي-غانم"
          },
          {
            "name": "ايت حدو يوسف",
            "slug": "ايت-حدو-يوسف"
          },
          {
            "name": "للاعزيزة",
            "slug": "للاعزيزة"
          },
          {
            "name": "بوابوض امدلان",
            "slug": "بوابوض-امدلان"
          },
          {
            "name": "رحالة",
            "slug": "رحالة"
          },
          {
            "name": "بوابوض",
            "slug": "بوابوض"
          },
          {
            "name": "كوزمت",
            "slug": "كوزمت"
          },
          {
            "name": "تمليلت",
            "slug": "تمليلت"
          },
          {
            "name": "اشمرارن",
            "slug": "اشمرارن"
          },
          {
            "name": "سيدي عبد المومن",
            "slug": "سيدي-عبد-المومن"
          },
          {
            "name": "تاولوكلت",
            "slug": "تاولوكلت"
          },
          {
            "name": "كماسة",
            "slug": "كماسة"
          },
          {
            "name": "مجاط",
            "slug": "مجاط-2"
          },
          {
            "name": "ادويران",
            "slug": "ادويران"
          },
          {
            "name": "الزاوية النحلية",
            "slug": "الزاوية-النحلية"
          },
          {
            "name": "امزوضة",
            "slug": "امزوضة"
          },
          {
            "name": "اسيف المال",
            "slug": "اسيف-المال"
          },
          {
            "name": "ادسيل",
            "slug": "ادسيل"
          },
          {
            "name": "امندونيت",
            "slug": "امندونيت"
          }
        ]
      },
      {
        "name": "إقليم الحوز",
        "slug": "ا-قليم-الحوز",
        "communes": [
          {
            "name": "أيت أورير",
            "slug": "ا-يت-ا-ورير"
          },
          {
            "name": "أمزميز",
            "slug": "ا-مزميز"
          },
          {
            "name": "تحناوت",
            "slug": "تحناوت"
          },
          {
            "name": "أيت سيدي داود",
            "slug": "ا-يت-سيدي-داود"
          },
          {
            "name": "أيت فاسكا",
            "slug": "ا-يت-فاسكا"
          },
          {
            "name": "سيدي عبد الله غيات",
            "slug": "سيدي-عبد-الله-غيات"
          },
          {
            "name": "تمازوزت",
            "slug": "تمازوزت"
          },
          {
            "name": "اكرفرون",
            "slug": "اكرفرون"
          },
          {
            "name": "اغمات",
            "slug": "اغمات"
          },
          {
            "name": "تدلي مسفيوة",
            "slug": "تدلي-مسفيوة"
          },
          {
            "name": "تمكرت",
            "slug": "تمكرت"
          },
          {
            "name": "التوامة",
            "slug": "التوامة"
          },
          {
            "name": "زرقطن",
            "slug": "زرقطن"
          },
          {
            "name": "تغدوين",
            "slug": "تغدوين"
          },
          {
            "name": "أيت عادل",
            "slug": "ا-يت-عادل"
          },
          {
            "name": "أيت احكيم-أيت ازيد",
            "slug": "ا-يت-احكيم-ا-يت-ازيد"
          },
          {
            "name": "أبادو",
            "slug": "ا-بادو"
          },
          {
            "name": "تزارت",
            "slug": "تزارت"
          },
          {
            "name": "اسني",
            "slug": "اسني"
          },
          {
            "name": "اغيل",
            "slug": "اغيل"
          },
          {
            "name": "اغبار",
            "slug": "اغبار"
          },
          {
            "name": "ثلاث نيعقوب",
            "slug": "ثلاث-نيعقوب"
          },
          {
            "name": "اجوكاك",
            "slug": "اجوكاك"
          },
          {
            "name": "امكدال",
            "slug": "امكدال"
          },
          {
            "name": "ويركان",
            "slug": "ويركان"
          },
          {
            "name": "أمغراس",
            "slug": "ا-مغراس"
          },
          {
            "name": "أنكال",
            "slug": "ا-نكال"
          },
          {
            "name": "ازكور",
            "slug": "ازكور"
          },
          {
            "name": "تزكين",
            "slug": "تزكين"
          },
          {
            "name": "دار الجامع",
            "slug": "دار-الجامع"
          },
          {
            "name": "سيدي بدهاج",
            "slug": "سيدي-بدهاج"
          },
          {
            "name": "أولاد امطاع",
            "slug": "ا-ولاد-امطاع"
          },
          {
            "name": "للاتكركوست",
            "slug": "للاتكركوست"
          },
          {
            "name": "وزكيتة",
            "slug": "وزكيتة"
          },
          {
            "name": "اوريكة",
            "slug": "اوريكة"
          },
          {
            "name": "ستي فاضمة",
            "slug": "ستي-فاضمة"
          },
          {
            "name": "اوكايمدن",
            "slug": "اوكايمدن"
          },
          {
            "name": "اغواطيم",
            "slug": "اغواطيم"
          },
          {
            "name": "مولاي ابراهيم",
            "slug": "مولاي-ابراهيم"
          },
          {
            "name": "تمصلوحت",
            "slug": "تمصلوحت"
          }
        ]
      },
      {
        "name": "إقليم قلعة السراغنة",
        "slug": "ا-قليم-قلعة-السراغنة",
        "communes": [
          {
            "name": "قلعة السراغنة",
            "slug": "قلعة-السراغنة"
          },
          {
            "name": "العطاوية",
            "slug": "العطاوية"
          },
          {
            "name": "سيدي رحال",
            "slug": "سيدي-رحال"
          },
          {
            "name": "تملالت",
            "slug": "تملالت"
          },
          {
            "name": "أولاد عراض",
            "slug": "ا-ولاد-عراض"
          },
          {
            "name": "الشعراء",
            "slug": "الشعراء"
          },
          {
            "name": "العطاوية الشعبية",
            "slug": "العطاوية-الشعبية"
          },
          {
            "name": "ادزوز",
            "slug": "ادزوز"
          },
          {
            "name": "فرايطة",
            "slug": "فرايطة"
          },
          {
            "name": "العثامنية",
            "slug": "العثامنية"
          },
          {
            "name": "واركي",
            "slug": "واركي"
          },
          {
            "name": "بوي عمر",
            "slug": "بوي-عمر"
          },
          {
            "name": "الصهريج",
            "slug": "الصهريج"
          },
          {
            "name": "سور العز",
            "slug": "سور-العز"
          },
          {
            "name": "أولاد خلوف",
            "slug": "ا-ولاد-خلوف"
          },
          {
            "name": "الواد لخضر",
            "slug": "الواد-لخضر"
          },
          {
            "name": "مزم صنهاجة",
            "slug": "مزم-صنهاجة"
          },
          {
            "name": "سيدي عيسى بن سليمان",
            "slug": "سيدي-عيسى-بن-سليمان"
          },
          {
            "name": "زمران",
            "slug": "زمران"
          },
          {
            "name": "زمران الشرقية",
            "slug": "زمران-الشرقية"
          },
          {
            "name": "الجوالة",
            "slug": "الجوالة"
          },
          {
            "name": "اجبيل",
            "slug": "اجبيل"
          },
          {
            "name": "أولاد صبيح",
            "slug": "ا-ولاد-صبيح"
          },
          {
            "name": "الهيادنة",
            "slug": "الهيادنة"
          },
          {
            "name": "أولاد زراد",
            "slug": "ا-ولاد-زراد"
          },
          {
            "name": "أولاد الشرقي",
            "slug": "ا-ولاد-الشرقي"
          },
          {
            "name": "المربوح",
            "slug": "المربوح"
          },
          {
            "name": "ميات",
            "slug": "ميات"
          },
          {
            "name": "سيدي موسى",
            "slug": "سيدي-موسى"
          },
          {
            "name": "العامرية",
            "slug": "العامرية"
          },
          {
            "name": "أولاد امسبل",
            "slug": "ا-ولاد-امسبل"
          },
          {
            "name": "أولاد مسعود",
            "slug": "ا-ولاد-مسعود"
          },
          {
            "name": "الدشرة",
            "slug": "الدشرة"
          },
          {
            "name": "أولاد عمرو",
            "slug": "ا-ولاد-عمرو"
          },
          {
            "name": "أولاد بوعلي الواد",
            "slug": "ا-ولاد-بوعلي-الواد"
          },
          {
            "name": "الرافعية",
            "slug": "الرافعية"
          },
          {
            "name": "توزينت",
            "slug": "توزينت"
          },
          {
            "name": "سيدي الحطاب",
            "slug": "سيدي-الحطاب"
          },
          {
            "name": "الشطيبة",
            "slug": "الشطيبة"
          },
          {
            "name": "ازنادة",
            "slug": "ازنادة"
          },
          {
            "name": "أولاد يعكوب",
            "slug": "ا-ولاد-يعكوب"
          },
          {
            "name": "أولاد الكرن",
            "slug": "ا-ولاد-الكرن"
          },
          {
            "name": "لوناسدة",
            "slug": "لوناسدة"
          }
        ]
      },
      {
        "name": "إقليم الصويرة",
        "slug": "ا-قليم-الصويرة",
        "communes": [
          {
            "name": "الصويرة",
            "slug": "الصويرة"
          },
          {
            "name": "الحنشان",
            "slug": "الحنشان"
          },
          {
            "name": "تالمست",
            "slug": "تالمست"
          },
          {
            "name": "أيت داوود",
            "slug": "ا-يت-داوود"
          },
          {
            "name": "تمنار",
            "slug": "تمنار"
          },
          {
            "name": "تكاط",
            "slug": "تكاط"
          },
          {
            "name": "أولاد امرابط",
            "slug": "ا-ولاد-امرابط"
          },
          {
            "name": "تفتاشت",
            "slug": "تفتاشت"
          },
          {
            "name": "مجي",
            "slug": "مجي"
          },
          {
            "name": "كشولة",
            "slug": "كشولة"
          },
          {
            "name": "المزيلات",
            "slug": "المزيلات"
          },
          {
            "name": "سيدي امحمد أومرزوق",
            "slug": "سيدي-امحمد-ا-ومرزوق"
          },
          {
            "name": "امرامر",
            "slug": "امرامر"
          },
          {
            "name": "سيدي بولعلام",
            "slug": "سيدي-بولعلام"
          },
          {
            "name": "سيدي عيسى الركراكي",
            "slug": "سيدي-عيسى-الركراكي"
          },
          {
            "name": "حد الدرا",
            "slug": "حد-الدرا"
          },
          {
            "name": "مسكالة",
            "slug": "مسكالة"
          },
          {
            "name": "المواريد",
            "slug": "المواريد"
          },
          {
            "name": "الكريمات",
            "slug": "الكريمات"
          },
          {
            "name": "لحسينات",
            "slug": "لحسينات"
          },
          {
            "name": "أيت سعيد",
            "slug": "ا-يت-سعيد"
          },
          {
            "name": "لكدادرة",
            "slug": "لكدادرة"
          },
          {
            "name": "أوناغة",
            "slug": "ا-وناغة"
          },
          {
            "name": "مولاي بوزرقطون",
            "slug": "مولاي-بوزرقطون"
          },
          {
            "name": "أقرمود",
            "slug": "ا-قرمود"
          },
          {
            "name": "سيدي إسحاق",
            "slug": "سيدي-ا-سحاق"
          },
          {
            "name": "سيدي علي الكراتي",
            "slug": "سيدي-علي-الكراتي"
          },
          {
            "name": "زاوية بن احميدة",
            "slug": "زاوية-بن-احميدة"
          },
          {
            "name": "المخاليف",
            "slug": "المخاليف"
          },
          {
            "name": "سيدي عبد الجليل",
            "slug": "سيدي-عبد-الجليل"
          },
          {
            "name": "سيدي لعروسي",
            "slug": "سيدي-لعروسي"
          },
          {
            "name": "أدغاس",
            "slug": "ا-دغاس"
          },
          {
            "name": "أسايس",
            "slug": "ا-سايس"
          },
          {
            "name": "بوزمور",
            "slug": "بوزمور"
          },
          {
            "name": "اكليف",
            "slug": "اكليف"
          },
          {
            "name": "تاكوشت",
            "slug": "تاكوشت"
          },
          {
            "name": "سيدي غانم",
            "slug": "سيدي-غانم-2"
          },
          {
            "name": "الزاويت",
            "slug": "الزاويت"
          },
          {
            "name": "تهلوانت",
            "slug": "تهلوانت"
          },
          {
            "name": "بيزضاض",
            "slug": "بيزضاض"
          },
          {
            "name": "سيدي كاوكي",
            "slug": "سيدي-كاوكي"
          },
          {
            "name": "اكرض",
            "slug": "اكرض"
          },
          {
            "name": "سيدي احمد اوحامد",
            "slug": "سيدي-احمد-اوحامد"
          },
          {
            "name": "تدزي",
            "slug": "تدزي"
          },
          {
            "name": "سيدي الجزولي",
            "slug": "سيدي-الجزولي"
          },
          {
            "name": "إيمي نتليت",
            "slug": "ا-يمي-نتليت"
          },
          {
            "name": "سميمو",
            "slug": "سميمو"
          },
          {
            "name": "تفضنة",
            "slug": "تفضنة"
          },
          {
            "name": "سيدي احمد السايح",
            "slug": "سيدي-احمد-السايح"
          },
          {
            "name": "إيدا وعزا",
            "slug": "ا-يدا-وعزا"
          },
          {
            "name": "أيت عيسى اححان",
            "slug": "ا-يت-عيسى-اححان"
          },
          {
            "name": "إمكراد",
            "slug": "ا-مكراد"
          },
          {
            "name": "تاركانت",
            "slug": "تاركانت"
          },
          {
            "name": "تمزكدة أوفتاس",
            "slug": "تمزكدة-ا-وفتاس"
          },
          {
            "name": "سيدي أحمد أومبارك",
            "slug": "سيدي-ا-حمد-ا-ومبارك"
          },
          {
            "name": "إيدا و كازو",
            "slug": "ا-يدا-و-كازو"
          },
          {
            "name": "إيدا وكلول",
            "slug": "ا-يدا-وكلول"
          }
        ]
      },
      {
        "name": "إقليم الرحامنة",
        "slug": "ا-قليم-الرحامنة",
        "communes": [
          {
            "name": "ابن جرير",
            "slug": "ابن-جرير"
          },
          {
            "name": "سيدي بوعثمان",
            "slug": "سيدي-بوعثمان"
          },
          {
            "name": "الجعافرة",
            "slug": "الجعافرة"
          },
          {
            "name": "سيدي عبد الله",
            "slug": "سيدي-عبد-الله"
          },
          {
            "name": "سكورة الحدرة",
            "slug": "سكورة-الحدرة"
          },
          {
            "name": "سيدي غانم",
            "slug": "سيدي-غانم-3"
          },
          {
            "name": "سيدي منصور",
            "slug": "سيدي-منصور"
          },
          {
            "name": "صخور الرحامنة",
            "slug": "صخور-الرحامنة"
          },
          {
            "name": "سيدي علي لبراحلة",
            "slug": "سيدي-علي-لبراحلة"
          },
          {
            "name": "أولاد حسون حمري",
            "slug": "ا-ولاد-حسون-حمري"
          },
          {
            "name": "لبريكيين",
            "slug": "لبريكيين"
          },
          {
            "name": "أولاد عامر تزمرين",
            "slug": "ا-ولاد-عامر-تزمرين"
          },
          {
            "name": "أيت حمو",
            "slug": "ا-يت-حمو"
          },
          {
            "name": "بوشان",
            "slug": "بوشان"
          },
          {
            "name": "أيت الطالب",
            "slug": "ا-يت-الطالب"
          },
          {
            "name": "بوروس",
            "slug": "بوروس"
          },
          {
            "name": "سيدي بوبكر",
            "slug": "سيدي-بوبكر-2"
          },
          {
            "name": "الجبيلات",
            "slug": "الجبيلات"
          },
          {
            "name": "انزالت لعظم",
            "slug": "انزالت-لعظم"
          },
          {
            "name": "لمحرة",
            "slug": "لمحرة"
          },
          {
            "name": "أولاد املول",
            "slug": "ا-ولاد-املول"
          },
          {
            "name": "عكرمة",
            "slug": "عكرمة"
          },
          {
            "name": "الطلوح",
            "slug": "الطلوح"
          },
          {
            "name": "الجعيدات",
            "slug": "الجعيدات"
          },
          {
            "name": "راس عين الرحامنة",
            "slug": "راس-عين-الرحامنة"
          }
        ]
      },
      {
        "name": "إقليم اسفي",
        "slug": "ا-قليم-اسفي",
        "communes": [
          {
            "name": "أسفي",
            "slug": "ا-سفي"
          },
          {
            "name": "جمعة سحيم",
            "slug": "جمعة-سحيم"
          },
          {
            "name": "سبت كزولة",
            "slug": "سبت-كزولة"
          },
          {
            "name": "لمراسلة",
            "slug": "لمراسلة"
          },
          {
            "name": "سيدي التيجي",
            "slug": "سيدي-التيجي"
          },
          {
            "name": "بوكدرة",
            "slug": "بوكدرة"
          },
          {
            "name": "شهدة",
            "slug": "شهدة"
          },
          {
            "name": "لحضر",
            "slug": "لحضر"
          },
          {
            "name": "لبخاتي",
            "slug": "لبخاتي"
          },
          {
            "name": "لمصابح",
            "slug": "لمصابح"
          },
          {
            "name": "الكرعاني",
            "slug": "الكرعاني"
          },
          {
            "name": "سيدي عيسى",
            "slug": "سيدي-عيسى"
          },
          {
            "name": "مول البركي",
            "slug": "مول-البركي"
          },
          {
            "name": "دار سي عيسى",
            "slug": "دار-سي-عيسى"
          },
          {
            "name": "اصعادلا",
            "slug": "اصعادلا"
          },
          {
            "name": "ايير",
            "slug": "ايير"
          },
          {
            "name": "البدوزة",
            "slug": "البدوزة"
          },
          {
            "name": "حرارة",
            "slug": "حرارة"
          },
          {
            "name": "خط ازكان",
            "slug": "خط-ازكان"
          },
          {
            "name": "اولاد سلمان",
            "slug": "اولاد-سلمان"
          },
          {
            "name": "نكا",
            "slug": "نكا"
          },
          {
            "name": "لعمامرة",
            "slug": "لعمامرة"
          },
          {
            "name": "الغيات",
            "slug": "الغيات"
          },
          {
            "name": "لمعاشات",
            "slug": "لمعاشات"
          },
          {
            "name": "اتوابت",
            "slug": "اتوابت"
          }
        ]
      },
      {
        "name": "إقليم اليوسفية",
        "slug": "ا-قليم-اليوسفية",
        "communes": [
          {
            "name": "اليوسفية",
            "slug": "اليوسفية"
          },
          {
            "name": "الشماعية",
            "slug": "الشماعية"
          },
          {
            "name": "اجنان بويه",
            "slug": "اجنان-بويه"
          },
          {
            "name": "جذور",
            "slug": "جذور"
          },
          {
            "name": "سيدي شكير",
            "slug": "سيدي-شكير"
          },
          {
            "name": "إيغود",
            "slug": "ا-يغود"
          },
          {
            "name": "اسبيعات",
            "slug": "اسبيعات"
          },
          {
            "name": "الكنتور",
            "slug": "الكنتور"
          },
          {
            "name": "رأس العين",
            "slug": "را-س-العين"
          },
          {
            "name": "اطياميم",
            "slug": "اطياميم"
          },
          {
            "name": "لخوالقة",
            "slug": "لخوالقة"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة درعة – تافلالت",
    "slug": "جهة-درعة-تافلالت",
    "provinces": [
      {
        "name": "إقليم الرشدية",
        "slug": "ا-قليم-الرشدية",
        "communes": [
          {
            "name": "الرشيدية",
            "slug": "الرشيدية"
          },
          {
            "name": "ارفود",
            "slug": "ارفود"
          },
          {
            "name": "كلميمة",
            "slug": "كلميمة"
          },
          {
            "name": "الجرف",
            "slug": "الجرف"
          },
          {
            "name": "مولاي علي الشريف",
            "slug": "مولاي-علي-الشريف"
          },
          {
            "name": "بودنيب",
            "slug": "بودنيب"
          },
          {
            "name": "تنجداد",
            "slug": "تنجداد"
          },
          {
            "name": "السيفا",
            "slug": "السيفا"
          },
          {
            "name": "عرب صباح زيز",
            "slug": "عرب-صباح-زيز"
          },
          {
            "name": "اعراب صباح اغريس",
            "slug": "اعراب-صباح-اغريس"
          },
          {
            "name": "فزنا",
            "slug": "فزنا"
          },
          {
            "name": "بني امحمد سجلماسة",
            "slug": "بني-امحمد-سجلماسة"
          },
          {
            "name": "الريصاني",
            "slug": "الريصاني"
          },
          {
            "name": "السفلات",
            "slug": "السفلات"
          },
          {
            "name": "الطاوس",
            "slug": "الطاوس"
          },
          {
            "name": "سيدي علي",
            "slug": "سيدي-علي"
          },
          {
            "name": "أوفوس",
            "slug": "ا-وفوس"
          },
          {
            "name": "الرتب",
            "slug": "الرتب"
          },
          {
            "name": "واد النعام",
            "slug": "واد-النعام"
          },
          {
            "name": "شرفاء مدغرة",
            "slug": "شرفاء-مدغرة"
          },
          {
            "name": "الخنك",
            "slug": "الخنك"
          },
          {
            "name": "اغبالو انكردوس",
            "slug": "اغبالو-انكردوس"
          },
          {
            "name": "اغريس السفلى",
            "slug": "اغريس-السفلى"
          },
          {
            "name": "اغريس العلوي",
            "slug": "اغريس-العلوي"
          },
          {
            "name": "تاديغوست",
            "slug": "تاديغوست"
          },
          {
            "name": "ملعب",
            "slug": "ملعب"
          },
          {
            "name": "فركلة السفلى",
            "slug": "فركلة-السفلى"
          },
          {
            "name": "فركلة العليا",
            "slug": "فركلة-العليا"
          },
          {
            "name": "املاكو",
            "slug": "املاكو"
          }
        ]
      },
      {
        "name": "إقليم ورزازات",
        "slug": "ا-قليم-ورزازات",
        "communes": [
          {
            "name": "ورزازات",
            "slug": "ورزازات"
          },
          {
            "name": "تازناخت",
            "slug": "تازناخت"
          },
          {
            "name": "امرزكان",
            "slug": "امرزكان"
          },
          {
            "name": "أيت زينب",
            "slug": "ا-يت-زينب"
          },
          {
            "name": "تلوات",
            "slug": "تلوات"
          },
          {
            "name": "اغرم نوكدال",
            "slug": "اغرم-نوكدال"
          },
          {
            "name": "تيدلي",
            "slug": "تيدلي"
          },
          {
            "name": "ازناكن",
            "slug": "ازناكن"
          },
          {
            "name": "وسلسات",
            "slug": "وسلسات"
          },
          {
            "name": "خزامة",
            "slug": "خزامة"
          },
          {
            "name": "سروا",
            "slug": "سروا"
          },
          {
            "name": "ترميكت",
            "slug": "ترميكت"
          },
          {
            "name": "ادلسان",
            "slug": "ادلسان"
          },
          {
            "name": "سكورة اهل الوسط",
            "slug": "سكورة-اهل-الوسط"
          },
          {
            "name": "توندوت",
            "slug": "توندوت"
          },
          {
            "name": "إمي نولاون",
            "slug": "ا-مي-نولاون"
          },
          {
            "name": "غسات",
            "slug": "غسات"
          }
        ]
      },
      {
        "name": "إقليم ميدلت",
        "slug": "ا-قليم-ميدلت",
        "communes": [
          {
            "name": "ميدلت",
            "slug": "ميدلت"
          },
          {
            "name": "الريش",
            "slug": "الريش"
          },
          {
            "name": "كرس تعلالين",
            "slug": "كرس-تعلالين"
          },
          {
            "name": "امزيزل",
            "slug": "امزيزل"
          },
          {
            "name": "سيدي عياد",
            "slug": "سيدي-عياد"
          },
          {
            "name": "النزالة",
            "slug": "النزالة"
          },
          {
            "name": "زاوية سيدي حمزة",
            "slug": "زاوية-سيدي-حمزة"
          },
          {
            "name": "كير",
            "slug": "كير"
          },
          {
            "name": "كرامة",
            "slug": "كرامة"
          },
          {
            "name": "ايت يحيى",
            "slug": "ايت-يحيى"
          },
          {
            "name": "اموكر",
            "slug": "اموكر"
          },
          {
            "name": "املشيل",
            "slug": "املشيل"
          },
          {
            "name": "بوازمو",
            "slug": "بوازمو"
          },
          {
            "name": "اوتربات",
            "slug": "اوتربات"
          },
          {
            "name": "ايت ازداك",
            "slug": "ايت-ازداك"
          },
          {
            "name": "ايت عياش",
            "slug": "ايت-عياش"
          },
          {
            "name": "ميبلادن",
            "slug": "ميبلادن"
          },
          {
            "name": "امرصيد",
            "slug": "امرصيد"
          },
          {
            "name": "ايت بن يعقوب",
            "slug": "ايت-بن-يعقوب"
          },
          {
            "name": "ايتزر",
            "slug": "ايتزر"
          },
          {
            "name": "زايدة",
            "slug": "زايدة"
          },
          {
            "name": "تنوردي",
            "slug": "تنوردي"
          },
          {
            "name": "تيزي نغشو",
            "slug": "تيزي-نغشو"
          },
          {
            "name": "بومية",
            "slug": "بومية"
          },
          {
            "name": "أغبالو",
            "slug": "ا-غبالو"
          },
          {
            "name": "أنمزي",
            "slug": "ا-نمزي"
          },
          {
            "name": "أكديم",
            "slug": "ا-كديم"
          },
          {
            "name": "سيدي يحيى ايوسف",
            "slug": "سيدي-يحيى-ايوسف"
          },
          {
            "name": "تونفيت",
            "slug": "تونفيت"
          }
        ]
      },
      {
        "name": "إقليم تنغير",
        "slug": "ا-قليم-تنغير",
        "communes": [
          {
            "name": "تنغير",
            "slug": "تنغير"
          },
          {
            "name": "بومالن دادس",
            "slug": "بومالن-دادس"
          },
          {
            "name": "قلعة مكونة",
            "slug": "قلعة-مكونة"
          },
          {
            "name": "ايت سدرات الجبل السفلى",
            "slug": "ايت-سدرات-الجبل-السفلى"
          },
          {
            "name": "ايت سدرات الجبل العليا",
            "slug": "ايت-سدرات-الجبل-العليا"
          },
          {
            "name": "ايت يول",
            "slug": "ايت-يول"
          },
          {
            "name": "ايت سدرات السهل الشرقية",
            "slug": "ايت-سدرات-السهل-الشرقية"
          },
          {
            "name": "ايت سدرات السهل الغربية",
            "slug": "ايت-سدرات-السهل-الغربية"
          },
          {
            "name": "أيت واسيف",
            "slug": "ا-يت-واسيف"
          },
          {
            "name": "سوق الخميس دادس",
            "slug": "سوق-الخميس-دادس"
          },
          {
            "name": "اغيل نومكون",
            "slug": "اغيل-نومكون"
          },
          {
            "name": "اكنيون",
            "slug": "اكنيون"
          },
          {
            "name": "امسمرير",
            "slug": "امسمرير"
          },
          {
            "name": "تلمي",
            "slug": "تلمي"
          },
          {
            "name": "اميضر",
            "slug": "اميضر"
          },
          {
            "name": "واكليم",
            "slug": "واكليم"
          },
          {
            "name": "تودغى العليا",
            "slug": "تودغى-العليا"
          },
          {
            "name": "تغزوت نايت عطى",
            "slug": "تغزوت-نايت-عطى"
          },
          {
            "name": "ايت الفرسي",
            "slug": "ايت-الفرسي"
          },
          {
            "name": "تودغى السفلى",
            "slug": "تودغى-السفلى"
          },
          {
            "name": "النيف",
            "slug": "النيف"
          },
          {
            "name": "مصيسي",
            "slug": "مصيسي"
          },
          {
            "name": "حصيا",
            "slug": "حصيا"
          },
          {
            "name": "ايت هاني",
            "slug": "ايت-هاني"
          },
          {
            "name": "اسول",
            "slug": "اسول"
          }
        ]
      },
      {
        "name": "إقليم زاكورة",
        "slug": "ا-قليم-زاكورة",
        "communes": [
          {
            "name": "زاكورة",
            "slug": "زاكورة"
          },
          {
            "name": "أكدز",
            "slug": "ا-كدز"
          },
          {
            "name": "بوزروال",
            "slug": "بوزروال"
          },
          {
            "name": "تنزولين",
            "slug": "تنزولين"
          },
          {
            "name": "ابليدة",
            "slug": "ابليدة"
          },
          {
            "name": "الروحا",
            "slug": "الروحا"
          },
          {
            "name": "ترناتة",
            "slug": "ترناتة"
          },
          {
            "name": "بني زولي",
            "slug": "بني-زولي"
          },
          {
            "name": "تافتشنا",
            "slug": "تافتشنا"
          },
          {
            "name": "تامكروت",
            "slug": "تامكروت"
          },
          {
            "name": "فزواطة",
            "slug": "فزواطة"
          },
          {
            "name": "امحاميد الغزلان",
            "slug": "امحاميد-الغزلان"
          },
          {
            "name": "تاكونيت",
            "slug": "تاكونيت"
          },
          {
            "name": "كتاوة",
            "slug": "كتاوة"
          },
          {
            "name": "تمزموط",
            "slug": "تمزموط"
          },
          {
            "name": "أولاد يحيى لكراير",
            "slug": "ا-ولاد-يحيى-لكراير"
          },
          {
            "name": "أفرا",
            "slug": "ا-فرا"
          },
          {
            "name": "مزكيطة",
            "slug": "مزكيطة"
          },
          {
            "name": "تنسيفت",
            "slug": "تنسيفت"
          },
          {
            "name": "أفلاندرا",
            "slug": "ا-فلاندرا"
          },
          {
            "name": "تغبالت",
            "slug": "تغبالت"
          },
          {
            "name": "ايت بوداود",
            "slug": "ايت-بوداود"
          },
          {
            "name": "تازارين",
            "slug": "تازارين-2"
          },
          {
            "name": "النقوب",
            "slug": "النقوب"
          },
          {
            "name": "ايت ولال",
            "slug": "ايت-ولال"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة سوس ماسة",
    "slug": "جهة-سوس-ماسة",
    "provinces": [
      {
        "name": "عمالة اكادير ادوتنان",
        "slug": "عمالة-اكادير-ادوتنان",
        "communes": [
          {
            "name": "أكادير",
            "slug": "ا-كادير"
          },
          {
            "name": "امسكروض",
            "slug": "امسكروض"
          },
          {
            "name": "اضمين",
            "slug": "اضمين"
          },
          {
            "name": "الدراركة",
            "slug": "الدراركة"
          },
          {
            "name": "أورير",
            "slug": "ا-ورير"
          },
          {
            "name": "تغازوت",
            "slug": "تغازوت"
          },
          {
            "name": "اقصري",
            "slug": "اقصري"
          },
          {
            "name": "إيموزار",
            "slug": "ا-يموزار"
          },
          {
            "name": "تقي",
            "slug": "تقي"
          },
          {
            "name": "تدرارت",
            "slug": "تدرارت"
          },
          {
            "name": "ازيار",
            "slug": "ازيار"
          },
          {
            "name": "تامري",
            "slug": "تامري"
          },
          {
            "name": "امسوان",
            "slug": "امسوان"
          }
        ]
      },
      {
        "name": "عمالة انزكان ايت ملول",
        "slug": "عمالة-انزكان-ايت-ملول",
        "communes": [
          {
            "name": "إنزكان",
            "slug": "ا-نزكان"
          },
          {
            "name": "أيت ملول",
            "slug": "ا-يت-ملول"
          },
          {
            "name": "الدشيرة الجهادية",
            "slug": "الدشيرة-الجهادية"
          },
          {
            "name": "لقليعة",
            "slug": "لقليعة"
          },
          {
            "name": "تمسية",
            "slug": "تمسية"
          },
          {
            "name": "أولاد دحو",
            "slug": "ا-ولاد-دحو"
          }
        ]
      },
      {
        "name": "إقليم شتوكة آيت باها",
        "slug": "ا-قليم-شتوكة-ا-يت-باها",
        "communes": [
          {
            "name": "أيت باها",
            "slug": "ا-يت-باها"
          },
          {
            "name": "بيوكرى",
            "slug": "بيوكرى"
          },
          {
            "name": "أيت مزال",
            "slug": "ا-يت-مزال"
          },
          {
            "name": "هلالة",
            "slug": "هلالة"
          },
          {
            "name": "تسكدلت",
            "slug": "تسكدلت"
          },
          {
            "name": "أيت وادريم",
            "slug": "ا-يت-وادريم"
          },
          {
            "name": "سيدي عبد الله البوشواري",
            "slug": "سيدي-عبد-الله-البوشواري"
          },
          {
            "name": "تركا نتوشكا",
            "slug": "تركا-نتوشكا"
          },
          {
            "name": "تنالت",
            "slug": "تنالت"
          },
          {
            "name": "أوكنز",
            "slug": "ا-وكنز"
          },
          {
            "name": "إدا وكنظيف",
            "slug": "ا-دا-وكنظيف"
          },
          {
            "name": "تيزي نتوشت",
            "slug": "تيزي-نتوشت"
          },
          {
            "name": "أيت عميرة",
            "slug": "ا-يت-عميرة"
          },
          {
            "name": "سيدي بيبي",
            "slug": "سيدي-بيبي"
          },
          {
            "name": "إمي مقورن",
            "slug": "ا-مي-مقورن"
          },
          {
            "name": "سيدي بو السحاب",
            "slug": "سيدي-بو-السحاب"
          },
          {
            "name": "واد الصفاء",
            "slug": "واد-الصفاء"
          },
          {
            "name": "بلفاع",
            "slug": "بلفاع"
          },
          {
            "name": "انشادن",
            "slug": "انشادن"
          },
          {
            "name": "ماسة",
            "slug": "ماسة"
          },
          {
            "name": "سيدي وساي",
            "slug": "سيدي-وساي"
          },
          {
            "name": "ايت ميلك",
            "slug": "ايت-ميلك"
          }
        ]
      },
      {
        "name": "إقليم تارودانت",
        "slug": "ا-قليم-تارودانت",
        "communes": [
          {
            "name": "تارودانت",
            "slug": "تارودانت"
          },
          {
            "name": "أولاد تايمة",
            "slug": "ا-ولاد-تايمة"
          },
          {
            "name": "إيغرم",
            "slug": "ا-يغرم"
          },
          {
            "name": "الكردان",
            "slug": "الكردان"
          },
          {
            "name": "أيت إيعزة",
            "slug": "ا-يت-ا-يعزة"
          },
          {
            "name": "أولاد برحيل",
            "slug": "ا-ولاد-برحيل"
          },
          {
            "name": "تالوين",
            "slug": "تالوين"
          },
          {
            "name": "أولوز",
            "slug": "ا-ولوز"
          },
          {
            "name": "سيدي مزال",
            "slug": "سيدي-مزال"
          },
          {
            "name": "أيت عبد الله",
            "slug": "ا-يت-عبد-الله"
          },
          {
            "name": "توفلعزت",
            "slug": "توفلعزت"
          },
          {
            "name": "تابيا",
            "slug": "تابيا"
          },
          {
            "name": "تومليلين",
            "slug": "تومليلين"
          },
          {
            "name": "إيماون",
            "slug": "ا-يماون"
          },
          {
            "name": "تندين",
            "slug": "تندين"
          },
          {
            "name": "سيدي بوعل",
            "slug": "سيدي-بوعل"
          },
          {
            "name": "أملو",
            "slug": "ا-ملو"
          },
          {
            "name": "تتاوت",
            "slug": "تتاوت"
          },
          {
            "name": "أزغارنيرس",
            "slug": "ا-زغارنيرس"
          },
          {
            "name": "تيسفان",
            "slug": "تيسفان"
          },
          {
            "name": "النحيت",
            "slug": "النحيت"
          },
          {
            "name": "والقاضي",
            "slug": "والقاضي"
          },
          {
            "name": "إمي نتيارت",
            "slug": "ا-مي-نتيارت"
          },
          {
            "name": "أضار",
            "slug": "ا-ضار"
          },
          {
            "name": "أركانة",
            "slug": "ا-ركانة"
          },
          {
            "name": "بيكودين",
            "slug": "بيكودين"
          },
          {
            "name": "تالماكانت",
            "slug": "تالماكانت"
          },
          {
            "name": "إميلمايس",
            "slug": "ا-ميلمايس"
          },
          {
            "name": "سيدي بوموسى",
            "slug": "سيدي-بوموسى"
          },
          {
            "name": "أهل الرمل",
            "slug": "ا-هل-الرمل"
          },
          {
            "name": "سيدي أحمد أو عمر",
            "slug": "سيدي-ا-حمد-ا-و-عمر"
          },
          {
            "name": "لكفيفات",
            "slug": "لكفيفات"
          },
          {
            "name": "سيدي موسى الحمري",
            "slug": "سيدي-موسى-الحمري"
          },
          {
            "name": "الدير",
            "slug": "الدير"
          },
          {
            "name": "إسن",
            "slug": "ا-سن"
          },
          {
            "name": "الكدية البيضاء",
            "slug": "الكدية-البيضاء"
          },
          {
            "name": "الخنافيف",
            "slug": "الخنافيف"
          },
          {
            "name": "لمهادي",
            "slug": "لمهادي"
          },
          {
            "name": "مشرع العين",
            "slug": "مشرع-العين"
          },
          {
            "name": "أصادص",
            "slug": "ا-صادص"
          },
          {
            "name": "تدسي نسندالن",
            "slug": "تدسي-نسندالن"
          },
          {
            "name": "تملوكت",
            "slug": "تملوكت"
          },
          {
            "name": "إيمولاس",
            "slug": "ا-يمولاس"
          },
          {
            "name": "تافراوتن",
            "slug": "تافراوتن"
          },
          {
            "name": "أيت مخلوف",
            "slug": "ا-يت-مخلوف"
          },
          {
            "name": "احمر لكلالشة",
            "slug": "احمر-لكلالشة"
          },
          {
            "name": "لمنيزلة",
            "slug": "لمنيزلة"
          },
          {
            "name": "زاوية سيدي الطاهر",
            "slug": "زاوية-سيدي-الطاهر"
          },
          {
            "name": "إدا و مومن",
            "slug": "ا-دا-و-مومن"
          },
          {
            "name": "سيدي دحمان",
            "slug": "سيدي-دحمان"
          },
          {
            "name": "افريجة",
            "slug": "افريجة"
          },
          {
            "name": "تيوت",
            "slug": "تيوت"
          },
          {
            "name": "سيدي احمد أو عبد الله",
            "slug": "سيدي-احمد-ا-و-عبد-الله"
          },
          {
            "name": "أيت اكاس",
            "slug": "ا-يت-اكاس"
          },
          {
            "name": "تزمورت",
            "slug": "تزمورت"
          },
          {
            "name": "بونرار",
            "slug": "بونرار"
          },
          {
            "name": "سيدي بورجا",
            "slug": "سيدي-بورجا"
          },
          {
            "name": "إيكودار امنابها",
            "slug": "ا-يكودار-امنابها"
          },
          {
            "name": "تنزرت",
            "slug": "تنزرت"
          },
          {
            "name": "لمهارة",
            "slug": "لمهارة"
          },
          {
            "name": "إكلي",
            "slug": "ا-كلي"
          },
          {
            "name": "أولاد عيسى",
            "slug": "ا-ولاد-عيسى-3"
          },
          {
            "name": "إدا وكيلال",
            "slug": "ا-دا-وكيلال"
          },
          {
            "name": "سيدي عبد الله أوسعيد",
            "slug": "سيدي-عبد-الله-ا-وسعيد"
          },
          {
            "name": "تالكجونت",
            "slug": "تالكجونت"
          },
          {
            "name": "تيزي نتاست",
            "slug": "تيزي-نتاست"
          },
          {
            "name": "أوناين",
            "slug": "ا-وناين"
          },
          {
            "name": "تافنكولت",
            "slug": "تافنكولت"
          },
          {
            "name": "سيدي واعزيز",
            "slug": "سيدي-واعزيز"
          },
          {
            "name": "تكوكة",
            "slug": "تكوكة"
          },
          {
            "name": "إدا وكماض",
            "slug": "ا-دا-وكماض"
          },
          {
            "name": "الفيض",
            "slug": "الفيض"
          },
          {
            "name": "أرزن",
            "slug": "ا-رزن"
          },
          {
            "name": "توغمرت",
            "slug": "توغمرت"
          },
          {
            "name": "تيسراس",
            "slug": "تيسراس"
          },
          {
            "name": "أوزيوة",
            "slug": "ا-وزيوة"
          },
          {
            "name": "تبقال",
            "slug": "تبقال"
          },
          {
            "name": "أهل تفنوت",
            "slug": "ا-هل-تفنوت"
          },
          {
            "name": "إكيدي",
            "slug": "ا-كيدي"
          },
          {
            "name": "تاويالت",
            "slug": "تاويالت"
          },
          {
            "name": "أسكاون",
            "slug": "ا-سكاون"
          },
          {
            "name": "تسوسفي",
            "slug": "تسوسفي"
          },
          {
            "name": "سيدي احساين",
            "slug": "سيدي-احساين"
          },
          {
            "name": "أسايس",
            "slug": "ا-سايس-2"
          },
          {
            "name": "أكادير ملول",
            "slug": "ا-كادير-ملول"
          },
          {
            "name": "أساكي",
            "slug": "ا-ساكي"
          },
          {
            "name": "زاكموزن",
            "slug": "زاكموزن"
          },
          {
            "name": "تزكزاوين",
            "slug": "تزكزاوين"
          },
          {
            "name": "أزرار",
            "slug": "ا-زرار"
          }
        ]
      },
      {
        "name": "إقليم تيزنيت",
        "slug": "ا-قليم-تيزنيت",
        "communes": [
          {
            "name": "تيزنيت",
            "slug": "تيزنيت"
          },
          {
            "name": "تافراوت",
            "slug": "تافراوت"
          },
          {
            "name": "أملن",
            "slug": "ا-ملن"
          },
          {
            "name": "تارسواط",
            "slug": "تارسواط"
          },
          {
            "name": "تاسريرت",
            "slug": "تاسريرت"
          },
          {
            "name": "أفلا إغير",
            "slug": "ا-فلا-ا-غير"
          },
          {
            "name": "إريغ نتاهلة",
            "slug": "ا-ريغ-نتاهلة"
          },
          {
            "name": "أيت وافقا",
            "slug": "ا-يت-وافقا"
          },
          {
            "name": "اثنين أداي",
            "slug": "اثنين-ا-داي"
          },
          {
            "name": "تفراوت المولود",
            "slug": "تفراوت-المولود"
          },
          {
            "name": "أنزي",
            "slug": "ا-نزي"
          },
          {
            "name": "تيغمي",
            "slug": "تيغمي"
          },
          {
            "name": "أيت إسفن",
            "slug": "ا-يت-ا-سفن"
          },
          {
            "name": "أربعاء أيت أحمد",
            "slug": "ا-ربعاء-ا-يت-ا-حمد"
          },
          {
            "name": "تيزغران",
            "slug": "تيزغران"
          },
          {
            "name": "إداوكوكمار",
            "slug": "ا-داوكوكمار"
          },
          {
            "name": "سيدي أحمد أوموسى",
            "slug": "سيدي-ا-حمد-ا-وموسى"
          },
          {
            "name": "أربعاء رسموكة",
            "slug": "ا-ربعاء-رسموكة"
          },
          {
            "name": "المعدر الكبير",
            "slug": "المعدر-الكبير"
          },
          {
            "name": "الركادة",
            "slug": "الركادة"
          },
          {
            "name": "وجان",
            "slug": "وجان"
          },
          {
            "name": "سيدي بو عبد اللي",
            "slug": "سيدي-بو-عبد-اللي"
          },
          {
            "name": "بونعمان",
            "slug": "بونعمان"
          },
          {
            "name": "اثنين أكلو",
            "slug": "اثنين-ا-كلو"
          },
          {
            "name": "أربعاء الساحل",
            "slug": "ا-ربعاء-الساحل"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة كلميم واد نون",
    "slug": "جهة-كلميم-واد-نون",
    "provinces": [
      {
        "name": "إقليم طاطا",
        "slug": "ا-قليم-طاطا",
        "communes": [
          {
            "name": "طاطا",
            "slug": "طاطا"
          },
          {
            "name": "اقا",
            "slug": "اقا"
          },
          {
            "name": "فم الحصن",
            "slug": "فم-الحصن"
          },
          {
            "name": "فم زكيد",
            "slug": "فم-زكيد"
          },
          {
            "name": "أيت وابلي",
            "slug": "ا-يت-وابلي"
          },
          {
            "name": "قصبة سيدي عبد الله بن مبارك",
            "slug": "قصبة-سيدي-عبد-الله-بن-مبارك"
          },
          {
            "name": "تزونين",
            "slug": "تزونين"
          },
          {
            "name": "تمنارت",
            "slug": "تمنارت"
          },
          {
            "name": "أم الكردان",
            "slug": "ا-م-الكردان"
          },
          {
            "name": "اديس",
            "slug": "اديس"
          },
          {
            "name": "تكزميرت",
            "slug": "تكزميرت"
          },
          {
            "name": "تكموت",
            "slug": "تكموت"
          },
          {
            "name": "تزغت",
            "slug": "تزغت"
          },
          {
            "name": "إسافن",
            "slug": "ا-سافن"
          },
          {
            "name": "أكينان",
            "slug": "ا-كينان"
          },
          {
            "name": "إبن يعقوب",
            "slug": "ا-بن-يعقوب"
          },
          {
            "name": "أقا إيغان",
            "slug": "ا-قا-ا-يغان"
          },
          {
            "name": "تليت",
            "slug": "تليت"
          },
          {
            "name": "الوكوم",
            "slug": "الوكوم"
          },
          {
            "name": "تسينت",
            "slug": "تسينت"
          }
        ]
      },
      {
        "name": "إقليم كلميم",
        "slug": "ا-قليم-كلميم",
        "communes": [
          {
            "name": "كلميم",
            "slug": "كلميم"
          },
          {
            "name": "بويزكارن",
            "slug": "بويزكارن"
          },
          {
            "name": "تكانت",
            "slug": "تكانت"
          },
          {
            "name": "أيت بوفلن",
            "slug": "ا-يت-بوفلن"
          },
          {
            "name": "إفران أطلس الصغير",
            "slug": "ا-فران-ا-طلس-الصغير"
          },
          {
            "name": "تيمولاي",
            "slug": "تيمولاي"
          },
          {
            "name": "تغجيجت",
            "slug": "تغجيجت"
          },
          {
            "name": "أمطضي",
            "slug": "ا-مطضي"
          },
          {
            "name": "أداي",
            "slug": "ا-داي"
          },
          {
            "name": "افركط",
            "slug": "افركط"
          },
          {
            "name": "أسرير",
            "slug": "ا-سرير"
          },
          {
            "name": "تكليت",
            "slug": "تكليت"
          },
          {
            "name": "فاصك",
            "slug": "فاصك"
          },
          {
            "name": "الشاطئ الأبيض",
            "slug": "الشاطي-الا-بيض"
          },
          {
            "name": "لبيار",
            "slug": "لبيار"
          },
          {
            "name": "راس امليل",
            "slug": "راس-امليل"
          },
          {
            "name": "لقصابي تكوست",
            "slug": "لقصابي-تكوست"
          },
          {
            "name": "تركى وساي",
            "slug": "تركى-وساي"
          },
          {
            "name": "تلوين أسكا",
            "slug": "تلوين-ا-سكا"
          },
          {
            "name": "أباينو",
            "slug": "ا-باينو"
          }
        ]
      },
      {
        "name": "إقليم اسا الزاك",
        "slug": "ا-قليم-اسا-الزاك",
        "communes": [
          {
            "name": "أسا",
            "slug": "ا-سا"
          },
          {
            "name": "الزاك",
            "slug": "الزاك"
          },
          {
            "name": "عوينة لهنا",
            "slug": "عوينة-لهنا"
          },
          {
            "name": "عوينة يغمان",
            "slug": "عوينة-يغمان"
          },
          {
            "name": "تويزكي",
            "slug": "تويزكي"
          },
          {
            "name": "لبويرات",
            "slug": "لبويرات"
          },
          {
            "name": "المحبس",
            "slug": "المحبس"
          }
        ]
      },
      {
        "name": "إقليم طانطان",
        "slug": "ا-قليم-طانطان",
        "communes": [
          {
            "name": "طانطان",
            "slug": "طانطان"
          },
          {
            "name": "الوطية",
            "slug": "الوطية"
          },
          {
            "name": "بن خليل",
            "slug": "بن-خليل"
          },
          {
            "name": "الشبيكة",
            "slug": "الشبيكة"
          },
          {
            "name": "أبطيح",
            "slug": "ا-بطيح"
          },
          {
            "name": "لمسيد",
            "slug": "لمسيد"
          },
          {
            "name": "تلمزون",
            "slug": "تلمزون"
          }
        ]
      },
      {
        "name": "إقليم سيدي إفني",
        "slug": "ا-قليم-سيدي-ا-فني",
        "communes": [
          {
            "name": "سيدي إفني",
            "slug": "سيدي-ا-فني"
          },
          {
            "name": "الأخصاص",
            "slug": "الا-خصاص"
          },
          {
            "name": "مستي",
            "slug": "مستي"
          },
          {
            "name": "اسبويا",
            "slug": "اسبويا"
          },
          {
            "name": "إمي نفاست",
            "slug": "ا-مي-نفاست"
          },
          {
            "name": "اثنين أملو",
            "slug": "اثنين-ا-ملو"
          },
          {
            "name": "تنكرفا",
            "slug": "تنكرفا"
          },
          {
            "name": "أربعاء ايت عبد الله",
            "slug": "ا-ربعاء-ايت-عبد-الله"
          },
          {
            "name": "تيوغزة",
            "slug": "تيوغزة"
          },
          {
            "name": "مير اللفت",
            "slug": "مير-اللفت"
          },
          {
            "name": "سيدي امبارك",
            "slug": "سيدي-امبارك"
          },
          {
            "name": "سيدي احساين أو علي",
            "slug": "سيدي-احساين-ا-و-علي"
          },
          {
            "name": "أيت الرخا",
            "slug": "ا-يت-الرخا"
          },
          {
            "name": "سيدي عبد الله أو بلعيد",
            "slug": "سيدي-عبد-الله-ا-و-بلعيد"
          },
          {
            "name": "تغيرت",
            "slug": "تغيرت"
          },
          {
            "name": "سبت النابور",
            "slug": "سبت-النابور"
          },
          {
            "name": "بوطروش",
            "slug": "بوطروش"
          },
          {
            "name": "إيضر",
            "slug": "ا-يضر"
          },
          {
            "name": "أنفك",
            "slug": "ا-نفك"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة العيون الساقية الحمراء",
    "slug": "جهة-العيون-الساقية-الحمراء",
    "provinces": [
      {
        "name": "إقليم العيون",
        "slug": "ا-قليم-العيون",
        "communes": [
          {
            "name": "العيون",
            "slug": "العيون"
          },
          {
            "name": "المرسى",
            "slug": "المرسى"
          },
          {
            "name": "بوكراع",
            "slug": "بوكراع"
          },
          {
            "name": "الدشيرة",
            "slug": "الدشيرة"
          },
          {
            "name": "فم الواد",
            "slug": "فم-الواد"
          }
        ]
      },
      {
        "name": "إقليم بوجدور",
        "slug": "ا-قليم-بوجدور",
        "communes": [
          {
            "name": "بوجدور",
            "slug": "بوجدور"
          },
          {
            "name": "لمسيد",
            "slug": "لمسيد-2"
          },
          {
            "name": "كتلة زمور",
            "slug": "كتلة-زمور"
          },
          {
            "name": "جريفية",
            "slug": "جريفية"
          }
        ]
      },
      {
        "name": "إقليم طرفاية",
        "slug": "ا-قليم-طرفاية",
        "communes": [
          {
            "name": "طرفاية",
            "slug": "طرفاية"
          },
          {
            "name": "الدورة",
            "slug": "الدورة"
          },
          {
            "name": "الحكونية",
            "slug": "الحكونية"
          },
          {
            "name": "أخفنير",
            "slug": "ا-خفنير"
          },
          {
            "name": "الطاح",
            "slug": "الطاح"
          }
        ]
      },
      {
        "name": "إقليم السمارة",
        "slug": "ا-قليم-السمارة",
        "communes": [
          {
            "name": "السمارة",
            "slug": "السمارة"
          },
          {
            "name": "الجديرية",
            "slug": "الجديرية"
          },
          {
            "name": "سيدي احمد لعروسي",
            "slug": "سيدي-احمد-لعروسي"
          },
          {
            "name": "امكالة",
            "slug": "امكالة"
          },
          {
            "name": "حوزة",
            "slug": "حوزة"
          },
          {
            "name": "تفاريتي",
            "slug": "تفاريتي"
          }
        ]
      }
    ]
  },
  {
    "name": "جهة الداخلة واد الذهب",
    "slug": "جهة-الداخلة-واد-الذهب",
    "provinces": [
      {
        "name": "إقليم وادي الذهب",
        "slug": "ا-قليم-وادي-الذهب",
        "communes": [
          {
            "name": "الداخلة",
            "slug": "الداخلة"
          },
          {
            "name": "العركوب",
            "slug": "العركوب"
          },
          {
            "name": "امليلي",
            "slug": "امليلي"
          },
          {
            "name": "بئر أنزران",
            "slug": "بي-ر-ا-نزران"
          },
          {
            "name": "اكليبات الفولة",
            "slug": "اكليبات-الفولة"
          },
          {
            "name": "ام دريكة",
            "slug": "ام-دريكة"
          },
          {
            "name": "ميجيك",
            "slug": "ميجيك"
          }
        ]
      },
      {
        "name": "إقليم اوسرد",
        "slug": "ا-قليم-اوسرد",
        "communes": [
          {
            "name": "الكويرة",
            "slug": "الكويرة"
          },
          {
            "name": "بئر كندوز",
            "slug": "بي-ر-كندوز"
          },
          {
            "name": "أوسرد",
            "slug": "ا-وسرد"
          },
          {
            "name": "اغوينيت",
            "slug": "اغوينيت"
          },
          {
            "name": "الزوك",
            "slug": "الزوك"
          },
          {
            "name": "تشلا",
            "slug": "تشلا"
          }
        ]
      }
    ]
  }
];
